[
  {
    "id": 1,
    "sku": "PS-X1-2024",
    "model": "X1 Carbon",
    "name": "Bike Helmet - Pro Safety X1",
    "image": "https://www.motomail.co.nz/user/images/16242.jpg?t=2304281441",
    "category": "On Road",
    "brandName": "Pro Safety",
    "groupName": "Best Sellers",
    "rating": 4.8,
    "discountPrice": 59.99,
    "price": 79.99,
    "discountPresent": 25,
    "productSell": 1250,
    "viewCart": 3200,
    "review": 428,
    "shortDetails": "Aerodynamic MIPS helmet with 22 vents for airflow. Adjustable dial-fit system ensures comfort. Reflective elements for low-light visibility. Meets CPSC safety standards. Removable/washable padding. Weighs only 280g. Suitable for road cycling, commuting, and recreation. Available in S/M/L sizes and multiple colors.",
    "detail": "The Pro Safety X1 helmet features advanced MIPS (Multi-directional Impact Protection System) technology that reduces rotational forces on the brain during angled impacts. The helmet weighs just 280g thanks to its in-mold construction that fuses the polycarbonate outer shell with the EPS foam liner. 22 optimized vents create exceptional airflow to keep you cool during intense rides. The adjustable dial-fit system ensures a perfect, comfortable fit for all head shapes. Reflective elements enhance visibility in low-light conditions. The helmet meets all CPSC safety standards and is suitable for road cycling, commuting, and recreational riding. Includes removable and washable padding to maintain freshness ride after ride. Available in three sizes (S, M, L) and multiple color options to match your style."
  },
  {
    "id": 2,
    "sku": "AG-PB20-2024",
    "model": "AquaGuard 20L",
    "name": "Waterproof Bike Pannier Bag",
    "image": "https://m.media-amazon.com/images/I/61hDKq2EpKL._AC_SL1000_.jpg",
    "category": "On/Off Road",
    "brandName": "Adventure Gear",
    "groupName": "New Products",
    "rating": 4.6,
    "discountPrice": 45.5,
    "price": 65.0,
    "discountPresent": 30,
    "productSell": 890,
    "viewCart": 2100,
    "review": 156,
    "shortDetails": "20L roll-top waterproof bag with quick-release mounts. Made from 600D polyester with welded seams. Reflective strips for night visibility. Includes interior pockets and laptop sleeve (fits 15”). Reinforced bottom. Folds compactly. 2-year warranty. Ideal for commuting/touring.",
    "detail": "This 20-liter waterproof pannier bag features a roll-top closure system that keeps your belongings completely dry even in heavy rain. The bag is constructed from durable 600D polyester with welded seams and a TPU laminate coating for ultimate waterproof protection. The quick-release mounting system attaches securely to most rear racks in seconds without tools. Reflective strips on all sides enhance visibility at night. The interior includes organizational pockets for small items and a laptop sleeve that fits up to 15-inch devices. When not in use, the bag folds down compactly for storage. The reinforced bottom panel resists wear from road debris. Ideal for commuting, touring, or grocery runs. Carries up to 25lbs safely. Backed by a 2-year warranty against manufacturing defects."
  },
  {
    "id": 3,
    "sku": "BT-SGP-2024",
    "model": "SecureGrip Pro",
    "name": "Bike Phone Mount - Secure Grip Pro",
    "image": "https://www.bobogears.com/wp-content/uploads/2024/12/BB-BM-021-021001.jpg",
    "category": "On Road",
    "brandName": "BikeTech",
    "groupName": "Hot Products",
    "rating": 4.4,
    "discountPrice": 19.99,
    "price": 29.99,
    "discountPresent": 33,
    "productSell": 3400,
    "viewCart": 7800,
    "review": 872,
    "shortDetails": "360° adjustable mount with shock absorption. Fits phones (4.7”–6.8”) including cases. Silicone-lined arms and aluminum construction. Handlebar clamp (22–35mm). One-handed operation. Compatible with all smartphones. Perfect for navigation/filming.",
    "detail": "The Secure Grip Pro phone mount features a four-point locking mechanism that holds your phone securely even on rough terrain. The silicone-lined adjustable arms fit phones from 4.7 to 6.8 inches (including cases). A 360° rotating ball joint allows perfect viewing angle adjustment in portrait or landscape orientation. The vibration-dampening design reduces shock transmission to your phone's camera. The aircraft-grade aluminum construction is both lightweight and durable. The handlebar clamp fits diameters from 22mm to 35mm and includes rubber padding to prevent scratches. Easy one-handed operation lets you insert or remove your phone quickly while riding. Compatible with all smartphone brands including iPhone, Samsung, Google Pixel, and others. Perfect for navigation, fitness tracking, or capturing your rides."
  },
  {
    "id": 4,
    "sku": "NR-800-2024",
    "model": "NightRider 800",
    "name": "LED Bike Light Set - NightRider 800",
    "image": "https://m.media-amazon.com/images/I/61xNcnVAjQL.jpg",
    "category": "On/Off Road",
    "brandName": "NightRider",
    "groupName": "Best Sellers",
    "rating": 4.7,
    "discountPrice": 34.99,
    "price": 49.99,
    "discountPresent": 30,
    "productSell": 2100,
    "viewCart": 4500,
    "review": 543,
    "shortDetails": "800-lumen front light + 50-lumen rear light. USB rechargeable (3hr charge). IPX5 waterproof. Quick-release mounts. 15hr runtime (low mode). Multiple flash patterns. Aluminum housing. Mounts on handlebars/helmets. 150m visibility range.",
    "detail": "The NightRider 800 set includes a powerful 800-lumen front headlight and a 50-lumen rear safety light. The front light features four modes (high, medium, low, and flashing) with a maximum runtime of 15 hours on low setting. The optical lens creates a focused beam pattern that illuminates the road ahead without blinding oncoming traffic. The rear light has multiple flash patterns for enhanced visibility. Both lights are USB rechargeable with a 3-hour charge time. The weatherproof IPX5 rating means they withstand rain and splashes. The quick-release mounts allow easy attachment/removal without tools. The front light's aluminum housing dissipates heat efficiently for consistent performance. Includes a charge level indicator and can be mounted on handlebars, helmets, or seatposts. Provides up to 150 meters of visibility to keep you safe during night rides."
  },
  {
    "id": 5,
    "sku": "PM-RS2-2024",
    "model": "RepairStand Pro",
    "name": "Bike Repair Stand - Pro Mechanic",
    "image": "https://www.rabe-bike.de/img/900/600/resize/catalog/product/f/a/fa003475003-b_1.jpg",
    "category": "On Road",
    "brandName": "ProMechanic",
    "groupName": "Sale Products",
    "rating": 4.9,
    "discountPrice": 129.99,
    "price": 179.99,
    "discountPresent": 28,
    "productSell": 420,
    "viewCart": 950,
    "review": 128,
    "shortDetails": "Professional aluminum stand (80lb capacity). Folding tripod base. 360° rotation. Telescoping tube (39”–63”). Tool tray included. Clamps 0.8”–2.5” frames. Non-slip feet. 5-year warranty. Used by pro cycling teams.",
    "detail": "The Pro Mechanic repair stand features a heavy-duty aluminum construction that supports bikes up to 80lbs (36kg). The three-legged folding design provides exceptional stability on uneven surfaces. An adjustable clamping mechanism securely holds frames from 0.8 to 2.5 inches in diameter without damaging the finish. The stand rotates 360° and locks at any angle for perfect working position. The telescoping main tube adjusts from 39 to 63 inches to accommodate different user heights. The tool tray holds all your repair essentials within easy reach. Folds down to just 36 inches for compact storage. The non-slip rubber feet prevent movement during intensive repairs. Ideal for home mechanics, bike shops, or mobile repair services. Used by professional cycling teams for its reliability and precision. Includes a 5-year warranty on the frame and clamp mechanism."
  },
  {
    "id": 6,
    "sku": "SW-AF23-2024",
    "model": "AirFlow Pro",
    "name": "Cycling Jersey - AirFlow Pro",
    "image": "https://craftsports.ca/cdn/shop/products/1913160-301000_ProAeroJerseyM_Front.jpg?v=1672931485",
    "category": "Racing",
    "brandName": "SpeedWear",
    "groupName": "Hot Products",
    "rating": 4.5,
    "discountPrice": 49.99,
    "price": 69.99,
    "discountPresent": 29,
    "productSell": 1560,
    "viewCart": 3200,
    "review": 287,
    "shortDetails": "Moisture-wicking jersey with UPF 50+. Three rear pockets + zippered security pocket. Race-fit design. Reflective logos. YKK full-length zipper. Silicone grippers. Men’s/women’s sizes (XS–XXL). Machine washable. Ideal for road cycling/triathlons.",
    "detail": "The AirFlow Pro jersey is constructed from advanced moisture-wicking fabric that keeps you cool and dry during intense rides. The lightweight, breathable material features UPF 50+ sun protection and four-way stretch for unrestricted movement. Three rear pockets provide ample storage for snacks, tools, and small items, with a zippered security pocket for valuables. The full-length YKK zipper allows for ventilation adjustment. Silicone grippers at the hem keep the jersey securely in place without constriction. The race-fit design reduces wind resistance while remaining comfortable for long distances. Reflective logos enhance visibility in low-light conditions. Available in sizes XS to XXL with both men's and women's specific cuts. Machine washable with color-fast technology that prevents fading. Perfect for road cycling, triathlons, or casual riding in warm weather conditions."
  },
  {
    "id": 7,
    "sku": "TG-TC2-2024",
    "model": "TurboCharger 2.0",
    "name": "Bike Floor Pump - Turbo Charger",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSBdkdOWnSyyfMRh5iRaesXc25PpEncIFpfJg&s",
    "category": "On/Off Road",
    "brandName": "TurboGear",
    "groupName": "Best Sellers",
    "rating": 4.7,
    "discountPrice": 39.99,
    "price": 59.99,
    "discountPresent": 33,
    "productSell": 1850,
    "viewCart": 4100,
    "review": 432,
    "shortDetails": "Dual-action pump (0–160 PSI gauge). Auto Presta/Schrader valve head. Steel barrel/base. 32” hose. Ergonomic T-handle. Non-slip feet. Bleed valve. Lifetime warranty. High-volume for MTB/road bikes.",
    "detail": "The Turbo Charger floor pump features a dual-action design that delivers air on both the up and down stroke for faster inflation. The professional-grade steel barrel and base provide exceptional durability. The smart valve head works with both Presta and Schrader valves automatically - no adapters or adjustments needed. The oversized 2.5-inch easy-read gauge displays pressure from 0 to 160 PSI with 1 PSI increments for precise pressure control. The ergonomic T-handle and non-slip foot pegs provide comfortable, stable pumping. The extra-long 32-inch hose reaches all valve positions easily. Includes a bleed valve for fine pressure adjustments. The pump's high-volume design inflates mountain bike tires quickly while still being capable of reaching road bike pressures. Ideal for home or shop use, with a lifetime warranty on the steel barrel and piston mechanism."
  },
  {
    "id": 8,
    "sku": "TITAN-UL-2024",
    "model": "UltraLock 14mm",
    "name": "Bike Lock - Titan Shield",
    "image": "https://m.media-amazon.com/images/I/81l-VCyRiNL.jpg",
    "category": "On Road",
    "brandName": "Titan",
    "groupName": "New Products",
    "rating": 4.3,
    "discountPrice": 54.95,
    "price": 79.95,
    "discountPresent": 31,
    "productSell": 2300,
    "viewCart": 5200,
    "review": 387,
    "shortDetails": "14mm hardened steel U-lock. Double deadbolt. $1500 anti-theft guarantee. Compact (5.5” x 9”). Pick-resistant cylinder. Includes 2 keys (1 LED). Vinyl coating. Resists angle grinders (5+ mins). 5-year warranty.",
    "detail": "The Titan Shield U-lock features a 14mm thick hardened steel shackle that resists cutting, prying, and leverage attacks. The double deadbolt mechanism provides two locking points for enhanced security. The lock comes with an anti-theft protection guarantee that reimburses up to $1500 if your bike is stolen while properly secured. The compact 5.5 x 9-inch size fits securely around bike frames and most fixed objects. The high-security disc-style cylinder is pick-resistant and includes a dust cover to prevent debris accumulation. Includes two weatherproof keys (one with LED light) and a mounting bracket for convenient transport. The vinyl coating protects your bike's finish from scratches. Tested to resist angle grinders for at least 5 minutes. Recommended by cycling organizations and police departments as one of the most secure portable locks available. Backed by a 5-year manufacturer's warranty."
  },
  {
    "id": 9,
    "sku": "UR-FS2-2024",
    "model": "FullShield V2",
    "name": "Bike Fenders - Urban Splash Guard",
    "image": "https://m.media-amazon.com/images/I/51ptBvVNm9L._AC_UF894,1000_QL80_.jpg",
    "category": "Scooter",
    "brandName": "UrbanRide",
    "groupName": "Sale Products",
    "rating": 4.2,
    "discountPrice": 29.99,
    "price": 44.99,
    "discountPresent": 33,
    "productSell": 980,
    "viewCart": 2100,
    "review": 154,
    "shortDetails": "Full-coverage aluminum fenders. Fits 28–45mm tires (700c/26”). Quick-release mounts (with/without eyelets). Mud flap included. Matte black finish. 15-min installation. Blocks road spray effectively for commuters.",
    "detail": "The Urban Splash Guard fender set provides complete protection from road spray in wet conditions. The lightweight aluminum construction with plastic lining is both durable and quiet. The quick-release mounting system fits most bikes with or without eyelets (includes both types of mounting hardware). The front fender extends down to the fork crown while the rear fender includes a mud flap for maximum coverage. The curved design follows your wheel's circumference to block spray effectively. Fits tires from 28mm to 45mm wide (700c or 26-inch wheels). The matte black finish resists scratches and maintains a clean appearance. Installation takes about 15 minutes with basic tools. Unlike clip-on fenders, these provide full-length protection that keeps you and your bike cleaner in rainy weather. Perfect for commuters, touring, or anyone who rides in wet conditions regularly."
  },
  {
    "id": 10,
    "sku": "CP-GC3-2024",
    "model": "GelComfort 3.0",
    "name": "Bike Seat Cushion - Comfort Ride Gel",
    "image": "https://m.media-amazon.com/images/I/81+f9hJKJxL._AC_SL1500_.jpg",
    "category": "On/Off Road",
    "brandName": "ComfortPlus",
    "groupName": "Hot Products",
    "rating": 4.1,
    "discountPrice": 24.99,
    "price": 34.99,
    "discountPresent": 29,
    "productSell": 3200,
    "viewCart": 6800,
    "review": 498,
    "shortDetails": "1” gel cushion with non-slip base. Moisture-wicking cover. Fits seats up to 10.5” wide. Elastic strap + front hooks. Reduces pressure/vibration. Machine washable. Ideal for commuters/casual riders.",
    "detail": "The Comfort Ride Gel seat cushion features a 1-inch thick viscoelastic gel layer that conforms to your body shape while reducing pressure points. The moisture-wicking top cover keeps you dry and comfortable during long rides. The non-slip rubberized base keeps the cover securely in place without shifting. The universal design fits most standard bike seats up to 10.5 inches wide. The breathable 4-way stretch fabric provides a comfortable fit without bunching. The rear elastic strap and front hook attachments ensure a secure fit on various seat shapes. The gel material absorbs vibrations from rough roads to reduce fatigue. Machine washable for easy cleaning. Ideal for commuters, casual riders, or anyone experiencing discomfort from their current bike seat. Can be used as a temporary solution while breaking in a new saddle or as a permanent comfort upgrade."
  },
  {
    "id": 11,
    "sku": "CL-BC1-2024",
    "model": "CarbonLite V1",
    "name": "Carbon Fiber Water Bottle Cage",
    "image": "https://static-01.daraz.com.bd/p/7965f801d8251d57a4487f14496e87cf.jpg",
    "category": "On Road",
    "brandName": "CarbonLite",
    "groupName": "New Products",
    "rating": 4.6,
    "discountPrice": 22.99,
    "price": 34.99,
    "discountPresent": 34,
    "productSell": 780,
    "viewCart": 1900,
    "review": 132,
    "shortDetails": "Ultralight 28g carbon fiber cage with secure grip. Fits standard water bottles. Aerodynamic design. Matte finish. Easy installation with included bolts. Compatible with all bike frames.",
    "detail": "The CarbonLite water bottle cage weighs just 28 grams while providing exceptional holding power for standard cycling water bottles. Made from high-modulus carbon fiber with a textured inner surface that prevents bottle slippage even on rough terrain. The aerodynamic shape reduces wind resistance compared to traditional cages. Includes stainless steel mounting bolts with rubber washers to prevent frame damage. The matte UV-resistant finish maintains its appearance through all weather conditions. Tested to hold bottles securely at speeds up to 50mph. Perfect for road racers looking to save weight without compromising functionality. Backed by a lifetime warranty against breakage under normal use."
  },
  {
    "id": 12,
    "sku": "TM-FP4-2024",
    "model": "FlatPedal Pro",
    "name": "MTB Flat Pedals - Trail Grip Pro",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQawIi5tb6bAibT82UO-pk8NrQc2KIjmcYPaQ&s",
    "category": "On/Off Road",
    "brandName": "TrailMaster",
    "groupName": "Best Sellers",
    "rating": 4.8,
    "discountPrice": 49.99,
    "price": 69.99,
    "discountPresent": 29,
    "productSell": 2100,
    "viewCart": 4500,
    "review": 387,
    "shortDetails": "Platform pedals with 10 replaceable pins per side. Chromoly spindle. Sealed bearings. 105x105mm platform. Concave shape for better grip. Works with all shoes. Ideal for downhill/trail riding.",
    "detail": "The Trail Grip Pro pedals feature a large 105x105mm concave platform that provides exceptional shoe contact and power transfer. Each pedal includes 10 replaceable traction pins (5mm length) that can be adjusted to match your preferred grip level. The chromoly steel spindle and dual sealed bearings ensure smooth rotation and durability in muddy/wet conditions. The nylon composite body is reinforced with fiberglass for impact resistance while remaining lightweight (380g/pair). The concave shape naturally centers your foot for better control during technical sections. Compatible with all shoe types from casual sneakers to mountain bike shoes. Includes a 6mm hex wrench for pin adjustment and spare pins. Trusted by enduro and downhill riders for their reliability in demanding conditions."
  },
  {
    "id": 13,
    "sku": "NT-GP8-2024",
    "model": "NavPro 800",
    "name": "Bike GPS Computer - NavPro 800",
    "image": "https://m.media-amazon.com/images/I/71FnDkYDGzL._AC_SL1500_.jpg",
    "category": "Racing",
    "brandName": "NavTech",
    "groupName": "Hot Products",
    "rating": 4.7,
    "discountPrice": 199.99,
    "price": 249.99,
    "discountPresent": 20,
    "productSell": 650,
    "viewCart": 1500,
    "review": 218,
    "shortDetails": "2.7” color touchscreen with 20hr battery. Preloaded maps. Bluetooth/ANT+ connectivity. 100+ activity profiles. Waterproof (IPX7). Includes HR monitor and speed/cadence sensors.",
    "detail": "The NavPro 800 GPS computer features a sunlight-readable 2.7-inch color touchscreen with customizable data fields. The device comes preloaded with detailed maps of North America/Europe and supports turn-by-turn navigation. Connects via Bluetooth and ANT+ to compatible heart rate monitors, power meters, and smart trainers. The 20-hour battery life (in GPS mode) extends to 40 hours in battery saver mode. Over 100 activity profiles are included for road cycling, mountain biking, commuting, and more. The IPX7 waterproof rating means it withstands heavy rain and accidental submersion. Includes a chest-based heart rate monitor, speed sensor, and cadence sensor in the bundle. The unit automatically syncs rides to your smartphone via the NavTech app for detailed analysis. Compatible with Strava, TrainingPeaks, and other popular platforms."
  },
  {
    "id": 14,
    "sku": "FR-AB3-2024",
    "model": "AnimalBell 3.0",
    "name": "Kids Bike Bell - Animal Series",
    "image": "https://m.media-amazon.com/images/I/619-71aShIL._AC_UF894,1000_QL80_.jpg",
    "category": "Scooter",
    "brandName": "FunRide",
    "groupName": "New Products",
    "rating": 4.5,
    "discountPrice": 8.99,
    "price": 12.99,
    "discountPresent": 31,
    "productSell": 3200,
    "viewCart": 6800,
    "review": 542,
    "shortDetails": "Colorful animal-shaped bells (lion, panda, dinosaur). Loud ping sound. Easy thumb operation. Fits handlebars 18-25mm. No tools installation. Safe non-toxic materials. Perfect for kids bikes/scooters.",
    "detail": "The Animal Series bike bells feature fun, colorful designs that kids love, available in lion, panda, and dinosaur shapes. Despite their playful appearance, these bells produce a loud 85dB ping sound that ensures visibility in traffic. The thumb-operated lever is sized perfectly for small hands. The universal clamp fits handlebars from 18mm to 25mm diameter and installs in seconds without tools. Made from durable ABS plastic with non-toxic, lead-free paints. The internal spring mechanism is corrosion-resistant for long-lasting performance. These bells help teach children important bike safety habits while adding personality to their ride. The bright colors maintain visibility even when not in use. Each bell comes with a surprise sticker pack featuring matching animal characters."
  },
  {
    "id": 15,
    "sku": "PC-CT2-2024",
    "model": "ChainTool Pro",
    "name": "Bike Chain Cleaner Tool",
    "image": "https://static-01.daraz.com.bd/p/77829e94c42144d6bd400714c6ae9194.png",
    "category": "On Road",
    "brandName": "ProClean",
    "groupName": "Sale Products",
    "rating": 4.4,
    "discountPrice": 14.99,
    "price": 22.99,
    "discountPresent": 35,
    "productSell": 1850,
    "viewCart": 4200,
    "review": 287,
    "shortDetails": "3-brush cleaning system with reservoir. Fits all chain widths. Compatible with degreasers. No-mess operation. Durable plastic construction. Includes scrub brush for cassettes. Works with 6-12 speed chains.",
    "detail": "The ProClean chain cleaning tool features three rotating brushes (top, bottom, and side) that thoroughly clean chain links, rollers, and side plates without removing the chain from your bike. The transparent reservoir holds up to 100ml of degreaser and allows you to monitor cleaning progress. The gear-driven brush system operates smoothly when pedaling backward. An additional stiff-bristle scrub brush is included for cassette and derailleur cleaning. The tool fits all chain widths from single-speed to 12-speed systems. The leak-proof design prevents messy spills during use. Made from impact-resistant ABS plastic that withstands harsh degreasers. Regular use extends chain life by removing abrasive grit and old lubricant. Complete cleaning takes under 5 minutes for a sparkling drivetrain."
  },
  {
    "id": 16,
    "sku": "AS-CW5-2024",
    "model": "Carbon50 Aero",
    "name": "Aero Bike Wheelset - Carbon 50",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTjCZn1bjZPRUl1j-d_2Ohnm6pOYy_BMq7LGA&s",
    "category": "Racing",
    "brandName": "AeroSpeed",
    "groupName": "Hot Products",
    "rating": 4.9,
    "discountPrice": 1299.99,
    "price": 1799.99,
    "discountPresent": 28,
    "productSell": 85,
    "viewCart": 320,
    "review": 42,
    "shortDetails": "50mm deep carbon clinchers. 18.5mm internal width. Ceramic bearings. Tubeless ready. Includes brake pads. 1480g/set. Compatible with 11/12-speed. Optimized for 25-28mm tires. Wind-tunnel tested.",
    "detail": "The Carbon 50 wheelset features wind-tunnel-optimized 50mm deep rims that provide exceptional aero performance across all yaw angles. The unidirectional carbon fiber construction offers the perfect balance of stiffness and compliance. The 18.5mm internal width optimally supports modern 25-28mm tires for reduced rolling resistance. Includes high-quality ceramic bearings that spin with less friction than standard bearings. The tubeless-ready design (with included rim tape) allows for lower tire pressures and fewer flats. The alloy braking surface provides consistent stopping power in all conditions. Each wheelset includes SwissStop Black Prince brake pads specifically formulated for carbon rims. The wheels weigh just 1480g per set (700g front/780g rear) and are hand-built in the USA. Compatible with Shimano/SRAM 11-12 speed systems. Backed by a 5-year warranty against manufacturing defects."
  },
  {
    "id": 17,
    "sku": "HM-CT1-2024",
    "model": "CargoHauler",
    "name": "Bike Cargo Trailer",
    "image": "https://rallykartworld.com/wp-content/uploads/2022/09/16D8B967-1B37-48A9-9B67-0914B23B5D23-1024x768.jpg",
    "category": "On/Off Road",
    "brandName": "HaulMaster",
    "groupName": "New Products",
    "rating": 4.3,
    "discountPrice": 199.99,
    "price": 279.99,
    "discountPresent": 29,
    "productSell": 210,
    "viewCart": 580,
    "review": 67,
    "shortDetails": "100lb capacity cargo trailer. Foldable design. 20” pneumatic tires. Safety flag included. Quick-release hitch. 60L storage volume. Weatherproof cover. Ideal for groceries/gear transport.",
    "detail": "The HaulMaster cargo trailer features a robust aluminum frame that supports up to 100lbs of cargo while remaining lightweight at just 18lbs. The foldable design collapses to 1/3 its size for compact storage. Large 20-inch pneumatic tires provide a smooth ride over bumps and uneven surfaces. The quick-release hitch system attaches to most rear axles in seconds without tools. The 60-liter main compartment is constructed from durable 600D polyester with a waterproof base. Includes a removable weatherproof cover for rainy conditions. An adjustable safety flag enhances visibility in traffic. The trailer tracks straight behind your bike thanks to its balanced design and articulating hitch. Perfect for grocery runs, camping gear transport, or moving bulky items car-free. Folds down to 30x20x10 inches for apartment storage. Includes a 2-year warranty on the frame and hitch mechanism."
  },
  {
    "id": 18,
    "sku": "CG-AW2-2024",
    "model": "ArmWrap Pro",
    "name": "Cycling Arm Warmers",
    "image": "https://hips.hearstapps.com/hmg-prod/images/bi-arm-warmers-a-1601328282.jpg",
    "category": "On Road",
    "brandName": "ClimateGear",
    "groupName": "Sale Products",
    "rating": 4.2,
    "discountPrice": 19.99,
    "price": 29.99,
    "discountPresent": 33,
    "productSell": 1250,
    "viewCart": 2800,
    "review": 198,
    "shortDetails": "Breathable thermal fabric with UPF 50+. Silicone gripper edge. Reflective details. One-size fits most. Easy on/off during rides. Machine washable. Ideal for changing weather conditions.",
    "detail": "These arm warmers are made from advanced thermal fabric that wicks moisture while providing UPF 50+ sun protection. The graduated compression fit ensures they stay in place without restricting circulation. A silicone gripper edge prevents slipping during intense riding. Reflective logos on both arms enhance visibility in low-light conditions. The one-size design fits arm circumferences from 9-13 inches through strategic stretch panels. Perfect for cool mornings when you need warmth but want to avoid a full jacket, as they easily fit in jersey pockets when not needed. The fabric provides warmth down to 50°F while remaining breathable to prevent overheating. Machine washable with color-fast dyes that resist fading. Compatible with most watch or fitness tracker wear. Ideal for road cyclists, triathletes, and commuters facing variable temperatures."
  },
  {
    "id": 19,
    "sku": "TR-PG4-2024",
    "model": "PegMaster 4.5",
    "name": "BMX Pegs - Chrome Alloy",
    "image": "https://bankruptbikeparts.co.uk/cdn/shop/products/s-l1600_5_7a1bb7b5-6af9-44bb-b857-6874138119b1_836x691.jpg?v=1636728846",
    "category": "On/Off Road",
    "brandName": "TrickRide",
    "groupName": "Best Sellers",
    "rating": 4.6,
    "discountPrice": 24.99,
    "price": 34.99,
    "discountPresent": 29,
    "productSell": 980,
    "viewCart": 2100,
    "review": 154,
    "shortDetails": "4.5” chromoly steel pegs. 14mm axle compatible. Knurled surface for grip. Includes spacers. Chrome plating resists rust. For grinding/support tricks. Sold as a pair. 200lb weight limit.",
    "detail": "These professional-grade BMX pegs are constructed from heat-treated chromoly steel for maximum strength during grinds and tricks. The 4.5-inch length provides ample surface area for foot placement while keeping weight manageable. The knurled surface pattern ensures solid grip even in wet conditions. Compatible with standard 14mm axles (includes necessary spacers for proper installation). The chrome plating resists rust and maintains a shiny appearance through countless grinds. Each pair supports up to 200lbs of rider weight. The internally splined design prevents rotation during tricks. Perfect for street, park, or flatland riding. Installation requires basic tools and takes about 10 minutes per wheel. Used by professional BMX riders for competitions. Backed by a 1-year warranty against bending or breakage under normal use."
  },
  {
    "id": 20,
    "sku": "SV-HM3-2024",
    "model": "HandleMirror 3.0",
    "name": "Bike Mirror - Handlebar Mount",
    "image": "https://m.media-amazon.com/images/I/71yYGDwQAFL.jpg",
    "category": "Scooter",
    "brandName": "SafeView",
    "groupName": "New Products",
    "rating": 4.0,
    "discountPrice": 12.99,
    "price": 18.99,
    "discountPresent": 32,
    "productSell": 2400,
    "viewCart": 5200,
    "review": 387,
    "shortDetails": "3” convex mirror with anti-glare coating. 360° adjustable arm. Rubberized handlebar clamp (22-35mm). Vibration damping. Shatterproof acrylic lens. Easy installation. Ideal for commuters.",
    "detail": "The SafeView bike mirror features a 3-inch convex mirror that provides a wide 180° rear view without significant distortion. The anti-glare coating reduces eye strain in bright sunlight. The flexible 8-inch arm allows precise positioning and folds inward when not needed. The rubberized handlebar clamp fits diameters from 22mm to 35mm and prevents rotation during rides. A vibration-damping ball joint keeps the image stable on rough surfaces. The shatterproof acrylic lens won't break into dangerous shards like glass mirrors. Installation takes under a minute with no tools required. Ideal for urban commuters who need to monitor traffic behind them without turning their heads. The mirror adjusts easily with one hand while riding. Weighs just 85g to avoid affecting handlebar balance. Includes a 2-year warranty against manufacturing defects."
  },
  {
    "id": 21,
    "sku": "CR-SP3-2024",
    "model": "SuspensionPost 30",
    "name": "Bike Suspension Seatpost",
    "image": "https://m.media-amazon.com/images/I/61cvVOKbElL._AC_UF1000,1000_QL80_.jpg",
    "category": "On/Off Road",
    "brandName": "ComfortRide",
    "groupName": "Hot Products",
    "rating": 4.5,
    "discountPrice": 89.99,
    "price": 129.99,
    "discountPresent": 31,
    "productSell": 420,
    "viewCart": 950,
    "review": 128,
    "shortDetails": "30mm travel suspension seatpost. Air/coil hybrid system. 350lb capacity. 27.2/31.6mm diameters. Tool-free sag adjustment. 185g weight. Reduces vibration/fatigue. Compatible with most bikes.",
    "detail": "The ComfortRide suspension seatpost combines an air spring with a coil negative spring for smooth, adjustable suspension travel. The 30mm of travel absorbs bumps and vibrations while maintaining pedaling efficiency. Supports riders up to 350lbs with progressive damping that prevents bottoming out. Available in two diameters (27.2mm and 31.6mm) to fit most modern bikes. The tool-free sag adjustment lets you customize the ride feel in seconds. Weighs just 185g—lighter than many rigid aluminum posts. The sealed cartridge bearing ensures years of maintenance-free operation. The micro-adjust clamp fits all standard rails (7mm or 9mm). Ideal for gravel bikes, commuters, and mountain bikers looking to reduce back fatigue on rough terrain. The black anodized finish resists scratches and corrosion. Includes a 3-year warranty on all moving parts."
  },
  {
    "id": 22,
    "sku": "SG-SR4-2024",
    "model": "SpokeReflect 4pk",
    "name": "Bike Wheel Reflectors - Spoke Clip",
    "image": "https://m.media-amazon.com/images/I/71wUcpBe7AL.jpg",
    "category": "Scooter",
    "brandName": "SafeGlow",
    "groupName": "Sale Products",
    "rating": 3.9,
    "discountPrice": 6.99,
    "price": 9.99,
    "discountPresent": 30,
    "productSell": 5200,
    "viewCart": 11200,
    "review": 742,
    "shortDetails": "Set of 4 spoke reflectors (2 orange, 2 white). Easy clip-on installation. Fits all spoke sizes. UV-resistant plastic. DOT-approved. Enhances side visibility. No tools required. 1-year warranty.",
    "detail": "These DOT-approved spoke reflectors dramatically improve your side visibility at night by creating a moving pattern that catches drivers' attention. Each set includes two orange and two white reflectors that clip onto spokes in seconds without tools. The universal design fits spoke diameters from 1.8mm to 2.5mm. Made from durable UV-resistant polycarbonate that won't fade or become brittle in sunlight. The reflectors maintain their position even on rough roads thanks to a secure locking mechanism. When hit by headlights, they create a distinctive circular motion that helps drivers judge your speed and distance. Meets all federal safety standards for bicycle reflectors. Installation takes under a minute per wheel—simply snap onto spokes at equal intervals. The lightweight design (12g per reflector) doesn't affect wheel balance. Ideal for commuters, children's bikes, and anyone riding at dawn/dusk."
  },
  {
    "id": 23,
    "sku": "CP-RR2-2024",
    "model": "RoofRack Aero",
    "name": "Bike Roof Rack - Aerodynamic",
    "image": "https://modularacks.com/cdn/shop/articles/ROOF_RACK_GUIDE_1920x.png?v=1728662938",
    "category": "On Road",
    "brandName": "CarryPro",
    "groupName": "New Products",
    "rating": 4.7,
    "discountPrice": 149.99,
    "price": 199.99,
    "discountPresent": 25,
    "productSell": 380,
    "viewCart": 850,
    "review": 112,
    "shortDetails": "Fits most cars with roof rails. Holds 2 bikes (max 35lb each). Aerodynamic design reduces noise. Tool-free bike attachment. Lockable (keys included). Foldable when not in use. 15-minute installation.",
    "detail": "The CarryPro roof rack features an aerodynamic shape that reduces wind noise by up to 50% compared to conventional racks while improving fuel efficiency. The universal mounting system fits factory roof rails on most sedans, SUVs, and wagons (check vehicle compatibility chart). Each tray holds bikes up to 35lbs with a secure ratcheting arm that clamps the front wheel without frame contact. The tool-free bike loading system lets you secure your bike in under 10 seconds. When not in use, the racks fold flat against the crossbars to minimize wind resistance. Includes an integrated locking system (2 keys) to deter theft. The UV-resistant materials won't degrade in sunlight. Installation takes about 15 minutes with basic tools—no permanent modifications to your vehicle required. Rated for highway speeds up to 80mph. Carries mountain, road, hybrid, and e-bikes (up to 2.8” tires). Backed by a 5-year warranty."
  },
  {
    "id": 24,
    "sku": "CG-TC2-2024",
    "model": "ToeCover Pro",
    "name": "Cycling Toe Covers",
    "image": "https://m.media-amazon.com/images/I/81YY4bqaSEL._AC_UF894,1000_QL80_.jpg",
    "category": "Racing",
    "brandName": "ClimateGear",
    "groupName": "Sale Products",
    "rating": 4.1,
    "discountPrice": 14.99,
    "price": 22.99,
    "discountPresent": 35,
    "productSell": 980,
    "viewCart": 2100,
    "review": 154,
    "shortDetails": "Neoprene toe covers for cycling shoes. Wind/water resistant. Reflective trim. Fits most road shoes. Easy on/off. Retains cleat access. 3mm thickness. Ideal for 45-60°F temperatures.",
    "detail": "These neoprene toe covers provide targeted warmth for the most vulnerable part of your foot during cool rides. The wind-resistant outer layer blocks chilling breezes while the 3mm neoprene insulation retains body heat. A water-repellent coating sheds light rain and road spray. The reflective trim enhances visibility from the front. Designed to work with most road cycling shoes—simply stretch over the toe box without interfering with cleats or boa dials. The anatomical shape follows your shoe's contours for a streamlined fit that won't catch wind. Easy to put on/take off without removing shoes. Ideal for early morning or late season rides when full shoe covers aren't necessary. Machine washable (air dry only). Pairs well with standard cycling socks. Available in black/gray with reflective silver accents."
  },
  {
    "id": 25,
    "sku": "AG-SB1-2024",
    "model": "StemBag Pro",
    "name": "Bike Stem Bag",
    "image": "https://bikepacking.com/wp-content/uploads/2015/10/bikepacking-stem-bag-02-740x494.jpg",
    "category": "On/Off Road",
    "brandName": "Adventure Gear",
    "groupName": "Best Sellers",
    "rating": 4.3,
    "discountPrice": 24.99,
    "price": 34.99,
    "discountPresent": 29,
    "productSell": 1250,
    "viewCart": 2800,
    "review": 198,
    "shortDetails": "1.5L handlebar/stem bag. Water-resistant 500D fabric. Dual zipper access. Internal organizer. Reflective details. Fits phones up to 6.8”. Includes mounting straps. Ideal for snacks/tools.",
    "detail": "This versatile stem bag mounts between your handlebar and stem for easy access to essentials during rides. The 1.5-liter main compartment features a water-resistant 500D polyester construction with welded seams. Dual YKK zippers allow access from either side while riding. An internal mesh organizer keeps small items like gels, keys, or cash neatly separated. The front pocket fits smartphones up to 6.8 inches with a clear touchscreen window for navigation. Reflective piping enhances visibility in low light. Includes three adjustable mounting straps that work with all stem types and handlebar diameters. The low-profile design doesn't interfere with knees during out-of-saddle efforts. Perfect for gravel riders, bikepackers, and commuters who need quick access to snacks, tools, or personal items. Weighs just 120g. Machine washable (remove straps first)."
  },
  {
    "id": 26,
    "sku": "FR-TW2-2024",
    "model": "TrainWheel Plus",
    "name": "Kids Bike Training Wheels",
    "image": "https://m.media-amazon.com/images/I/61CuLLdv+mL._AC_UF1000,1000_QL80_.jpg",
    "category": "Scooter",
    "brandName": "FirstRide",
    "groupName": "New Products",
    "rating": 4.4,
    "discountPrice": 19.99,
    "price": 29.99,
    "discountPresent": 33,
    "productSell": 2100,
    "viewCart": 4500,
    "review": 387,
    "shortDetails": "Adjustable height training wheels. Steel construction. Fits 12-20” bikes. Easy installation. Includes all hardware. 4” durable plastic wheels. Teaches balance gradually. Supports up to 75lbs.",
    "detail": "These training wheels help children transition from complete support to independent riding through adjustable height settings. The heavy-duty steel frame attaches securely to most rear axles on 12-inch to 20-inch kids' bikes. The 4-inch plastic wheels feature sealed bearings for smooth rolling and durability. Three height positions allow gradual raising as the child develops balance—start with both wheels touching the ground, then raise incrementally until they're riding unaided. The quick-release clamp system makes installation tool-free (takes about 5 minutes). Supports riders up to 75lbs. The bright colors make them appealing to kids while increasing visibility. Unlike cheap models, these won't bend or wobble during use. Includes a parent guide with progressive training exercises. Perfect for children ages 3-7 learning to ride. Backed by a 2-year warranty against manufacturing defects."
  },
  {
    "id": 27,
    "sku": "PL-CL2-2024",
    "model": "ChainLube Pro",
    "name": "Bike Chain Lube - All Conditions",
    "image": "https://muc-off.com/cdn/shop/files/01-All-Weather-Chain-Lube-PDP-Highlight_7e6597e0-e48f-4590-99fc-b9172d2a6e02_950x_crop_center.jpg?v=1615480402&68617",
    "category": "On Road",
    "brandName": "ProLube",
    "groupName": "Best Sellers",
    "rating": 4.6,
    "discountPrice": 9.99,
    "price": 14.99,
    "discountPresent": 33,
    "productSell": 5200,
    "viewCart": 11200,
    "review": 742,
    "shortDetails": "Wax-based lubricant for all weather. 4oz bottle (100+ applications). Dust/dirt resistant. Biodegradable formula. Easy application nozzle. Extends chain life. Works on 6-12 speed chains.",
    "detail": "This advanced wax-based chain lubricant provides superior protection in both wet and dry conditions. The formula penetrates deep into chain rollers while forming a protective wax coating that resists dirt accumulation. One 4oz bottle treats a chain over 100 times—simply apply to each roller, wait 5 minutes, then wipe off excess. The biodegradable formula is environmentally friendly and won't attract harmful grit like some petroleum-based lubes. Compatible with all chain types from single-speed to 12-speed systems. Regular use reduces wear by up to 50% compared to running dry. The precision nozzle allows controlled application without messy drips. Performs optimally between 30°F and 100°F. A single application lasts up to 200 dry miles or 100 wet miles. Also works well on derailleur pivot points and cables. Used by professional cycling teams for its reliability across diverse conditions."
  },
  {
    "id": 28,
    "sku": "AG-FB3-2024",
    "model": "FrameBag Tri",
    "name": "Bike Frame Bag - Triangle",
    "image": "https://rockgeist.com/wp-content/uploads/2015/11/DSC09101-1.jpg",
    "category": "On/Off Road",
    "brandName": "Adventure Gear",
    "groupName": "Hot Products",
    "rating": 4.5,
    "discountPrice": 39.99,
    "price": 59.99,
    "discountPresent": 33,
    "productSell": 780,
    "viewCart": 1900,
    "review": 132,
    "shortDetails": "Fits most bike triangles. 3L capacity. Water-resistant 1000D fabric. 6 attachment points. Internal divider. Reflective trim. Fits tools/tubes/snacks. No interference with pedaling.",
    "detail": "This frame bag maximizes storage space in your bike's main triangle without affecting pedaling efficiency. The 3-liter capacity accommodates tools, spare tubes, snacks, or a small jacket. Constructed from rugged 1000D Cordura nylon with a waterproof TPU backing that keeps contents dry in rain. Six secure attachment points (4 velcro straps + 2 ziptie slots) ensure stability on rough terrain. The internal divider helps organize small items and includes a key clip. Reflective piping enhances visibility from the side. The low-profile design fits most road, gravel, and mountain bike frames (measure your triangle before ordering). The zipper features an oversized pull for easy access with gloves. Weighs just 180g empty. Perfect for bikepacking, long-distance touring, or riders who need to carry more than fits in a saddle bag. Made in the USA with a 3-year warranty against defects."
  },
  {
    "id": 29,
    "sku": "PM-TS2-2024",
    "model": "TruingStand Pro",
    "name": "Bike Wheel Truing Stand",
    "image": "https://m.media-amazon.com/images/I/61NodDudZGL.jpg",
    "category": "On Road",
    "brandName": "ProMechanic",
    "groupName": "Sale Products",
    "rating": 4.7,
    "discountPrice": 89.99,
    "price": 129.99,
    "discountPresent": 31,
    "productSell": 210,
    "viewCart": 580,
    "review": 67,
    "shortDetails": "Professional wheel truing stand. Fits 20-29” wheels. Adjustable calipers. Includes dishing tool. Aluminum construction. Foldable base. For home mechanics/shops. 5-year warranty.",
    "detail": "The ProMechanic truing stand provides workshop-quality wheel alignment at home. The precision-machined aluminum construction ensures accurate measurements within 0.5mm. Adjustable calipers accommodate rim widths from 18mm to 40mm and wheel diameters from 20 inches (kids' bikes) to 29 inches (MTB). The included dishing tool checks wheel centering relative to the hub. The foldable base stores compactly when not in use. Rubberized feet prevent slipping during adjustments. The numbered measurement scale simplifies consistent spoke tensioning. Works with both rim brake and disc brake wheels. Perfect for maintaining straight wheels, fixing minor impacts, or building custom wheelsets. Includes a detailed instruction manual with troubleshooting tips. Used by professional wheel builders for its repeatable accuracy. The tool pays for itself after just a few wheel trues compared to shop visits. Backed by a 5-year warranty on all components."
  },
  {
    "id": 30,
    "sku": "CR-CH1-2024",
    "model": "CupHolder Pro",
    "name": "Bike Cup Holder",
    "image": "https://motocoffee.com/cdn/shop/articles/BX2A1102.jpg?v=1712528781&width=1100",
    "category": "Scooter",
    "brandName": "ComfortRide",
    "groupName": "New Products",
    "rating": 3.8,
    "discountPrice": 12.99,
    "price": 18.99,
    "discountPresent": 32,
    "productSell": 2400,
    "viewCart": 5200,
    "review": 387,
    "shortDetails": "Handlebar-mounted cup holder. Fits 12-30oz tumblers. Adjustable clamp (22-35mm). Silicone liner grips cups. 360° swivel. No tools installation. Ideal for coffee/water bottles on cruisers.",
    "detail": "This practical cup holder keeps your beverage securely within reach during relaxed rides. The adjustable clamp fits handlebars from 22mm to 35mm diameter and installs in seconds without tools. The silicone-lined interior grips cups, cans, or tumblers from 2.5” to 3.5” diameter (12-30oz capacity). A 360° swivel joint allows perfect positioning regardless of handlebar angle. The rigid plastic construction prevents flexing, while the silicone liner absorbs vibrations to minimize spills. The open-bottom design accommodates tall travel mugs with handles. Perfect for commuters, beach cruisers, or electric bike riders who want to enjoy coffee or water without stopping. The black finish blends discreetly with most bike styles. Weighs just 90g. Not intended for off-road use or carbon handlebars. Includes a 1-year warranty against breakage under normal use."
  }
]