[
  {
    "id": "1",
    "name": "Thunderbolt X900",
    "images": "https://img.freepik.com/free-photo/cool-motorcycle-outdoors_23-2150849443.jpg?semt=ais_hybrid&w=740",
    "category": "Sports",
    "topSpeed": "186 mph (299 km/h)",
    "power": "212 hp @ 13,000 rpm",
    "torque": "83 lb-ft @ 10,500 rpm",
    "mileage": "38 mpg (6.2 L/100 km)",
    "brakesType": "Dual 320mm floating discs with radial-mount 4-piston calipers (front), Single 220mm disc with single-piston caliper (rear)",
    "tyreType": "Radial, Front: 120/70ZR17, Rear: 190/55ZR17",
    "originalPrice": 18999,
    "bikeWeight": "423 lbs (192 kg)",
    "engineType": "Liquid-cooled, 4-cylinder, DOHC",
    "companyName": "Velocity Motors",
    "shortDescription": "The Thunderbolt X900 is a track-focused sports bike with cutting-edge technology, offering blistering performance and razor-sharp handling for adrenaline-seeking riders.",
    "description": "The Thunderbolt X900 represents the pinnacle of sports bike engineering, combining cutting-edge technology with breathtaking performance. This machine is designed for riders who demand the ultimate in speed, handling, and style. At the heart of the X900 lies a liquid-cooled, 4-cylinder, 16-valve DOHC engine that delivers explosive power across the entire rev range. The advanced electronic package includes multiple riding modes, traction control, quick-shifter, and cornering ABS for unparalleled control in all conditions. The lightweight aluminum frame and premium suspension components work in harmony to provide razor-sharp handling, while the aerodynamic bodywork slices through the air with minimal resistance. Every component has been meticulously designed for performance, from the race-derived braking system to the high-grip radial tires. The X900 isn't just about brute power - it's about delivering that power with precision and finesse. The riding position strikes the perfect balance between aggressive sportiness and everyday usability, making it suitable for both track days and spirited road riding. The full-color TFT display provides all essential information at a glance, while the LED lighting system ensures maximum visibility. With its combination of track-ready performance and street-legal practicality, the Thunderbolt X900 redefines what a production sports bike can achieve. Whether you're carving through mountain passes or dominating straight-line sprints, this machine delivers an adrenaline-pumping experience that few can match.",
    "bikeFeature": "The Thunderbolt X900 boasts an array of premium features that set it apart from the competition. The advanced electronics package includes five riding modes (Rain, Road, Dynamic, Race, and User), allowing riders to tailor the bike's character to their preferences and road conditions. The bi-directional quick-shifter enables seamless clutchless upshifts and downshifts, while the IMU-based traction control system provides optimal grip in all situations. The full-color 5-inch TFT display is customizable and supports smartphone connectivity via Bluetooth. For comfort, the bike features an adjustable windscreen, ergonomic seat design, and vibration-damped footpegs. The LED lighting system includes adaptive cornering lights that follow your lean angle. Practical touches include a USB charging port, underseat storage compartment, and a fuel gauge with range estimation. The X900 also features a lightweight titanium exhaust system that enhances performance while producing an exhilarating soundtrack. With its combination of cutting-edge technology and rider-focused design, the Thunderbolt X900 delivers an unmatched riding experience."
  },
  {
    "id": "2",
    "name": "Road King Classic",
    "images": "https://s1.cdn.autoevolution.com/images/moto_gallery/HARLEY-DAVIDSON-Road-King-Classic-7134_1.jpg",
    "category": "Cruiser",
    "topSpeed": "110 mph (177 km/h)",
    "power": "92 hp @ 5,450 rpm",
    "torque": "119 lb-ft @ 3,250 rpm",
    "mileage": "45 mpg (5.2 L/100 km)",
    "brakesType": "Dual 300mm floating discs with 4-piston calipers (front), Single 292mm disc with 2-piston caliper (rear)",
    "tyreType": "Bias-ply, Front: 130/90B16, Rear: 180/65B16",
    "originalPrice": 21499,
    "bikeWeight": "799 lbs (362 kg)",
    "engineType": "Air-cooled, Milwaukee-Eight 107 V-twin",
    "companyName": "Harley-Davidson",
    "shortDescription": "The Road King Classic combines timeless cruiser styling with modern touring comfort, offering an authentic American motorcycling experience with contemporary reliability.",
    "description": "The Road King Classic embodies the pure essence of American cruising, blending timeless styling with modern performance. This iconic motorcycle features a powerful air-cooled Milwaukee-Eight 107 V-twin engine that delivers massive low-end torque perfect for highway cruising. The classic styling includes a large windscreen, leather saddlebags, and abundant chrome accents that pay homage to Harley-Davidson's rich heritage. The comfortable two-up seat and relaxed riding position make it ideal for long-distance touring, while the advanced suspension system soaks up road imperfections with ease. The Road King Classic comes equipped with a Boom! Box infotainment system featuring GPS navigation, Bluetooth connectivity, and premium audio for entertainment on the go. The reflective tank badges, whitewall tires, and nostalgic paint schemes complete the vintage-inspired look. Despite its classic appearance, this cruiser is packed with modern technology including keyless ignition, cruise control, and LED lighting. The large 6-gallon fuel tank provides an impressive range between fill-ups, making it perfect for cross-country adventures. Whether you're cruising down Main Street or exploring scenic byways, the Road King Classic delivers an authentic American motorcycling experience with contemporary reliability and comfort.",
    "bikeFeature": "The Road King Classic offers a host of features designed for comfort and convenience. The Milwaukee-Eight 107 engine provides smooth power delivery with reduced vibration thanks to its counterbalanced design. The ergonomic seat and adjustable handlebars allow riders to find their perfect position, while the detachable windscreen offers customizable wind protection. The integrated hard saddlebags provide ample storage space with easy-to-use latch mechanisms. Modern amenities include a full-color touchscreen infotainment system with voice recognition, turn-by-turn navigation, and smartphone integration. For safety, the bike comes equipped with ABS brakes, traction control, and a security system. The LED headlight and taillight improve visibility, while the self-canceling turn signals add convenience. The cruise control system maintains speed on long highway stretches, reducing rider fatigue. Additional features include a steering lock, passenger footpegs with rubber inserts, and a center stand for easy maintenance. The classic instrumentation includes analog speedometer and fuel gauge with digital odometer and trip meters. With its perfect blend of old-school charm and modern technology, the Road King Classic delivers an unforgettable riding experience."
  },
  {
    "id": "3",
    "name": "Adventure Pro 850",
    "images": "https://img.freepik.com/free-photo/safely-motorcycle-helmet_23-2151531323.jpg?semt=ais_hybrid&w=740",
    "category": "Dual-Purpose",
    "topSpeed": "118 mph (190 km/h)",
    "power": "95 hp @ 8,000 rpm",
    "torque": "68 lb-ft @ 6,500 rpm",
    "mileage": "52 mpg (4.5 L/100 km)",
    "brakesType": "Dual 310mm wave discs with radial 4-piston calipers (front), Single 265mm wave disc with single-piston caliper (rear)",
    "tyreType": "Dual-sport, Front: 90/90-21, Rear: 150/70-18",
    "originalPrice": 14299,
    "bikeWeight": "507 lbs (230 kg)",
    "engineType": "Liquid-cooled, parallel-twin",
    "companyName": "Adventure Motors",
    "shortDescription": "The Adventure Pro 850 is a versatile dual-sport bike equally capable on highways and off-road trails, designed for riders who refuse to be limited by terrain.",
    "description": "The Adventure Pro 850 is the ultimate do-anything motorcycle designed to conquer both paved roads and rugged trails with equal competence. Built around a robust parallel-twin engine, this adventure bike delivers smooth power across the rev range while maintaining impressive fuel efficiency. The high-strength steel frame provides excellent durability and handling characteristics, complemented by long-travel suspension that absorbs bumps and jumps with confidence. With 9.5 inches of ground clearance and a 21-inch front wheel, the Adventure Pro 850 can tackle challenging off-road terrain while remaining stable at highway speeds. The adjustable windscreen and comfortable upright riding position reduce fatigue on long journeys, while the 6.5-gallon fuel tank ensures an impressive range between fill-ups. The bike comes equipped with multiple ride modes (Road, Rain, Off-Road, and Custom) that adjust throttle response, ABS, and traction control settings to match riding conditions. The tubeless spoke wheels combine off-road toughness with on-road convenience, while the skid plate and handguards provide essential protection during adventurous rides. Whether you're commuting through city streets, touring across continents, or exploring remote dirt trails, the Adventure Pro 850 adapts to your riding style and environment with remarkable versatility. The bright LED lighting ensures excellent visibility in all conditions, and the comprehensive digital display provides all essential information at a glance, including fuel range, tire pressure, and gear position.",
    "bikeFeature": "The Adventure Pro 850 is packed with features that enhance both on-road and off-road performance. The advanced electronics package includes cornering ABS, lean-angle sensitive traction control, and cruise control for highway comfort. The full-color TFT display is sunlight readable and shows navigation prompts when connected to your smartphone. The quick-release luggage system allows easy mounting of panniers for touring adventures. The adjustable suspension can be tuned for rider weight and load requirements, with rebound and compression damping adjustments. Practical features include a 12V power outlet, USB charging port, and center stand. The heated grips and seat ensure comfort in cold weather conditions, while the engine protection bars safeguard vital components during off-road excursions. The bike comes with tubeless tires that can be repaired on the go, and the chain features an O-ring design for reduced maintenance. The modular design allows for easy access to the air filter and other service points. With its combination of off-road capability and touring comfort, the Adventure Pro 850 is the perfect companion for riders who refuse to be limited by terrain or distance."
  },
  {
    "id": "4",
    "name": "Urban Commuter 300",
    "images": "https://cdn-fastly.motorcycle.com/media/2023/02/22/8756950/top-10-city-commuter-motorcycles.jpg?size=720x845&nocrop=1",
    "category": "Standard",
    "topSpeed": "90 mph (145 km/h)",
    "power": "32 hp @ 8,500 rpm",
    "torque": "22 lb-ft @ 7,000 rpm",
    "mileage": "78 mpg (3.0 L/100 km)",
    "brakesType": "Single 296mm disc with 2-piston caliper (front), Single 220mm disc with single-piston caliper (rear)",
    "tyreType": "Street, Front: 110/70-17, Rear: 140/70-17",
    "originalPrice": 4999,
    "bikeWeight": "348 lbs (158 kg)",
    "engineType": "Fuel-injected, single-cylinder",
    "companyName": "UrbanRide",
    "shortDescription": "The Urban Commuter 300 is an affordable, fuel-efficient city bike with agile handling and low maintenance requirements, perfect for daily transportation.",
    "description": "The Urban Commuter 300 is the perfect solution for city dwellers seeking an efficient, agile, and affordable motorcycle for daily transportation. Powered by a fuel-injected 300cc single-cylinder engine, this lightweight bike delivers peppy performance while achieving outstanding fuel economy. The slim profile and low seat height make it easy to maneuver through congested city streets and fit into tight parking spaces. The upright riding position provides excellent visibility in traffic, while the comfortable seat and well-tuned suspension soak up urban road imperfections. The Urban Commuter 300 features a modern digital instrument cluster that displays all essential information including fuel consumption, gear position, and clock. The efficient LED lighting ensures good visibility while conserving battery power, and the integrated storage compartment under the seat provides space for small essentials. The lightweight chassis and responsive handling make this bike particularly enjoyable on twisty backroads, while the modest power output keeps insurance costs low for new riders. With its low maintenance requirements and excellent reliability, the Urban Commuter 300 is an ideal choice for students, urban professionals, and anyone looking for practical, economical transportation. The bike's simple yet stylish design appeals to a wide range of riders, and the available accessories including top case, windscreen, and heated grips allow for personalization based on individual needs and preferences.",
    "bikeFeature": "The Urban Commuter 300 includes numerous features designed specifically for city riding. The fuel-injected engine ensures easy starts in all weather conditions and delivers smooth power delivery. The assist-and-slipper clutch reduces lever effort and prevents rear-wheel hop during aggressive downshifts. The LCD dashboard includes a gear position indicator, fuel gauge, and real-time fuel economy display. The maintenance-free battery and sealed chain reduce upkeep requirements, while the center stand simplifies parking and maintenance tasks. Practical touches include a helmet lock, luggage hook, and 12V power outlet for charging devices. The lightweight wheels and narrow tires contribute to the bike's agile handling, while the single-cylinder engine design keeps weight low and centralized for better balance. The bike comes with a security system that includes an immobilizer and steering lock. The comfortable seat is designed for all-day riding comfort, and the upright handlebar position reduces strain on the rider's back and wrists. With its combination of practicality, efficiency, and fun-to-ride character, the Urban Commuter 300 makes every city journey more enjoyable."
  },
  {
    "id": "5",
    "name": "Enduro Warrior 450",
    "images": "https://rideexpeditions.com/wp-content/uploads/2016/12/WR4-1024x681.jpg",
    "category": "Off-Road",
    "topSpeed": "85 mph (137 km/h)",
    "power": "52 hp @ 9,000 rpm",
    "torque": "35 lb-ft @ 7,000 rpm",
    "mileage": "45 mpg (5.2 L/100 km)",
    "brakesType": "Single 260mm wave disc with 2-piston caliper (front), Single 220mm wave disc with single-piston caliper (rear)",
    "tyreType": "Knobby, Front: 80/100-21, Rear: 110/100-18",
    "originalPrice": 9799,
    "bikeWeight": "251 lbs (114 kg)",
    "engineType": "Liquid-cooled, single-cylinder",
    "companyName": "DirtMaster",
    "shortDescription": "The Enduro Warrior 450 is a competition-ready off-road machine built to dominate trails and endure harsh conditions with championship-level performance.",
    "description": "The Enduro Warrior 450 is a competition-ready off-road machine designed to dominate trails, endure harsh conditions, and deliver exhilarating performance in the dirt. Built around a high-performance 450cc single-cylinder engine, this lightweight enduro bike delivers explosive power that can be precisely controlled by experienced riders. The compact chassis features a chromium-molybdenum steel frame that offers the perfect balance of rigidity and flex for optimal handling on rough terrain. With 12 inches of suspension travel at both ends, the Enduro Warrior 450 soaks up jumps, rocks, and ruts with confidence, while the premium suspension components allow for fine-tuning to match rider preferences and track conditions. The narrow bodywork and aggressive ergonomics allow for easy movement on the bike, essential for technical riding and weight shifting. The high-mounted exhaust system improves ground clearance and protects the muffler from impacts, while the plastic skid plate shields the engine from rocks and debris. The Enduro Warrior 450 comes with a close-ratio 5-speed transmission optimized for off-road competition, featuring a heavy-duty clutch designed to withstand aggressive use. The lightweight wheels are fitted with high-grip knobby tires that provide exceptional traction in dirt, mud, and sand. While primarily designed for off-road use, this bike includes minimal lighting and a quiet exhaust insert to meet basic requirements for limited street legality where applicable. For serious off-road enthusiasts and competitors, the Enduro Warrior 450 represents the pinnacle of performance and durability in its class.",
    "bikeFeature": "The Enduro Warrior 450 is packed with race-oriented features that give competitive riders an edge. The high-compression 450cc engine features a dual-overhead cam design with four titanium valves for maximum power and quick revving. The electric start system ensures quick restarts during races, backed up by a kickstarter for reliability. The adjustable handlebar mounts allow for personalized ergonomics, while the grippy seat cover keeps the rider firmly in place during aggressive riding. The hydraulic clutch provides consistent feel and requires minimal maintenance, while the high-capacity radiator and cooling fan prevent overheating in slow technical sections. The bike comes with a hour meter to track maintenance intervals, and the easy-access air filter simplifies cleaning between rides. The lightweight aluminum swingarm reduces unsprung weight for better suspension performance, while the chain adjusters feature hash marks for precise alignment. The competition-style footpegs are extra wide with sharp teeth for maximum boot grip, and the folding shift lever prevents damage in crashes. The minimalist digital display shows essential information including speed, engine hours, and lap timer functionality. With its no-compromise approach to off-road performance, the Enduro Warrior 450 is built to win races and conquer the toughest trails."
  },
  {
    "id": "6",
    "name": "Grand Touring Elite",
    "images": "https://static1.topspeedimages.com/wordpress/wp-content/uploads/2024/01/bmw-r-18-transcontinetal-action.jpg",
    "category": "Touring",
    "topSpeed": "125 mph (201 km/h)",
    "power": "125 hp @ 7,500 rpm",
    "torque": "96 lb-ft @ 6,000 rpm",
    "mileage": "42 mpg (5.6 L/100 km)",
    "brakesType": "Dual 320mm floating discs with 4-piston radial calipers (front), Single 298mm disc with 2-piston caliper (rear)",
    "tyreType": "Touring, Front: 130/70R18, Rear: 180/55R17",
    "originalPrice": 28999,
    "bikeWeight": "842 lbs (382 kg)",
    "engineType": "Liquid-cooled, six-cylinder",
    "companyName": "Grand Touring Motors",
    "shortDescription": "The Grand Touring Elite redefines luxury motorcycle travel with premium amenities, advanced technology, and effortless long-distance comfort for discerning riders.",
    "description": "The Grand Touring Elite redefines long-distance motorcycle travel with its perfect blend of luxury, performance, and cutting-edge technology. Designed for riders who demand the ultimate in comfort and convenience on extended journeys, this premium touring machine features a smooth 1,800cc six-cylinder engine that delivers effortless power across the entire speed range. The advanced chassis combines with electronic suspension adjustment to provide a magic carpet-like ride quality, automatically adapting to road conditions and riding style. The spacious ergonomics include an adjustable rider seat, heated grips, and floorboards for optimal comfort during marathon riding sessions. The integrated hard luggage system offers 150 liters of weatherproof storage capacity, enough for two people's gear on cross-country adventures. The Grand Touring Elite comes equipped with a state-of-the-art infotainment system featuring a 10-inch color touchscreen, GPS navigation, Bluetooth audio, and smartphone integration. The advanced safety systems include adaptive cruise control, blind spot monitoring, and emergency brake assist, all working together to reduce rider fatigue and enhance safety. The electrically adjustable windscreen provides customizable wind protection, while the premium audio system delivers crystal-clear sound even at highway speeds. With its combination of luxurious amenities and serious touring capability, the Grand Touring Elite transforms long days in the saddle into pure pleasure. Whether you're exploring scenic byways or making time on the interstate, this motorcycle delivers an unmatched touring experience with every mile.",
    "bikeFeature": "The Grand Touring Elite boasts an impressive array of features designed for the discerning traveler. The electronic suspension adjustment automatically adapts to load and road conditions, or can be manually configured via the onboard computer. The integrated navigation system includes real-time traffic updates and weather information, while the premium audio system features Apple CarPlay and Android Auto compatibility. Comfort features include heated seats for both rider and passenger, heated grips, and adjustable floorboards. The advanced safety suite includes cornering lights, tire pressure monitoring, and hill hold control. The keyless ignition system allows for easy starting while the central locking system secures all luggage compartments with the touch of a button. The full LED lighting system includes adaptive headlights that pivot with the bike's lean angle for better visibility in curves. The cruise control system maintains speed with precision, while the shift assist feature allows for clutchless upshifts and downshifts. The large 7.5-gallon fuel tank provides an impressive range between fill-ups, and the fuel filler is conveniently located for easy access. With its comprehensive array of luxury features and touring-specific innovations, the Grand Touring Elite sets new standards for two-wheeled travel comfort and convenience."
  },
  {
    "id": "7",
    "name": "Naked Streetfighter",
    "images": "https://www.team-bhp.com/forum/attachments/superbikes-imports/1926751d1571921806-ducati-announces-their-new-naked-streetfighter-v4-v4s-2020ducatistreetfighterv41.jpg",
    "category": "Standard",
    "topSpeed": "155 mph (249 km/h)",
    "power": "150 hp @ 11,000 rpm",
    "torque": "78 lb-ft @ 9,000 rpm",
    "mileage": "45 mpg (5.2 L/100 km)",
    "brakesType": "Dual 320mm discs with radial-mount 4-piston calipers (front), Single 245mm disc with 2-piston caliper (rear)",
    "tyreType": "Sport, Front: 120/70ZR17, Rear: 180/55ZR17",
    "originalPrice": 15499,
    "bikeWeight": "419 lbs (190 kg)",
    "engineType": "Liquid-cooled, inline-four",
    "companyName": "Street Power",
    "shortDescription": "The Naked Streetfighter combines raw performance with aggressive styling, delivering brutal acceleration and razor-sharp handling for adrenaline-seeking urban riders.",
    "description": "The Naked Streetfighter combines raw performance with aggressive styling to create the ultimate hooligan machine for urban environments and twisty backroads. Stripped of unnecessary bodywork and powered by a ferocious 1,000cc inline-four engine, this motorcycle delivers explosive acceleration and thrilling performance at every twist of the throttle. The minimalist design showcases the mechanical components, with the trellis frame, high-mounted exhaust, and muscular fuel tank creating an intimidating presence. The upright riding position provides excellent control and visibility in city traffic, while the wide handlebars offer precise steering input for carving through corners. Despite its aggressive nature, the Naked Streetfighter features advanced electronics including multiple riding modes, traction control, and ABS that can be adjusted to suit rider preference and road conditions. The high-quality suspension components provide responsive handling without sacrificing comfort, making this bike surprisingly capable on longer rides. The LED lighting gives the Streetfighter a modern, high-tech appearance while improving visibility, and the digital instrument cluster provides all essential information in a clean, easy-to-read format. Whether you're blasting through city streets, attacking mountain passes, or simply enjoying the visceral thrill of an unfiltered riding experience, the Naked Streetfighter delivers adrenaline-pumping performance with street-smart practicality. The combination of brutal power, lightweight agility, and head-turning style makes this motorcycle impossible to ignore wherever it goes.",
    "bikeFeature": "The Naked Streetfighter comes loaded with performance-focused features that enhance both fun and safety. The powerful 1,000cc engine features ride-by-wire throttle control for precise response and four riding modes (Rain, Road, Sport, and Track). The quick-shifter allows for clutchless upshifts at full throttle, while the slipper clutch prevents rear-wheel hop during aggressive downshifts. The full-color TFT display changes appearance based on selected riding mode and includes a gear position indicator and shift lights. The LED lighting package includes a distinctive daytime running light signature and ultra-bright tail light. Practical touches include a USB charging port under the seat and adjustable brake and clutch levers. The lightweight aluminum wheels reduce unsprung weight for better handling, while the radial-mount brake calipers provide exceptional stopping power. The bike comes with a steering damper to enhance stability at high speeds, and the adjustable suspension can be tuned for rider weight and preference. The compact design includes clever details like an under-engine exhaust that keeps the center of gravity low and the tail section clean. With its combination of cutting-edge technology and raw, unfiltered performance, the Naked Streetfighter delivers an exhilarating riding experience that appeals to experienced motorcyclists who appreciate both power and precision."
  },
  {
    "id": "8",
    "name": "Desert Raid 700",
    "images": "https://www.bransonsmotorcycles.co.uk/i/?item_id=127&item_type=central&item_size=medium",
    "category": "Off-Road",
    "topSpeed": "105 mph (169 km/h)",
    "power": "72 hp @ 8,000 rpm",
    "torque": "52 lb-ft @ 6,500 rpm",
    "mileage": "40 mpg (5.9 L/100 km)",
    "brakesType": "Single 260mm wave disc with 2-piston caliper (front), Single 220mm wave disc with single-piston caliper (rear)",
    "tyreType": "Desert, Front: 90/90-21, Rear: 140/80-18",
    "originalPrice": 12899,
    "bikeWeight": "329 lbs (149 kg)",
    "engineType": "Liquid-cooled, single-cylinder",
    "companyName": "Dakar Performance",
    "shortDescription": "The Desert Raid 700 is a Dakar-inspired off-road machine built to conquer the most challenging desert terrain with speed and reliability.",
    "description": "The Desert Raid 700 is a purpose-built off-road machine designed to conquer the most challenging desert terrain with speed and reliability. Inspired by Dakar Rally racing machines, this high-performance enduro bike features a potent 700cc single-cylinder engine that delivers explosive power while maintaining impressive durability in harsh conditions. The lightweight chromoly frame provides exceptional rigidity and precise handling at high speeds over rough terrain, while the long-travel suspension (11.8 inches front and rear) soaks up massive impacts from jumps and whoops. The tall seat height and narrow bodywork allow for easy rider movement when standing on the pegs, essential for maintaining control in technical sections. The Desert Raid 700 comes equipped with a large 4.5-gallon fuel tank for extended range in remote areas, along with a rally-style navigation tower that can accommodate road books or GPS units. The high-mounted air intake and sealed electrical components allow for deep water crossings, while the heavy-duty skid plate protects the engine from rocks and debris. The aggressive tread pattern on the knobby tires provides exceptional traction in sand, dirt, and loose surfaces, while the powerful brakes offer precise speed control in all conditions. Whether you're competing in desert races, exploring remote trails, or simply enjoying the thrill of high-speed off-road riding, the Desert Raid 700 delivers championship-level performance in a production motorcycle package. The combination of lightweight construction, massive suspension travel, and race-proven components makes this bike capable of conquering terrain that would stop lesser machines in their tracks.",
    "bikeFeature": "The Desert Raid 700 includes numerous features designed specifically for extreme off-road performance. The fuel-injected 700cc engine features a counterbalancer to reduce vibration and a heavy-duty cooling system for reliability in hot conditions. The six-speed transmission has wide ratios to handle both technical trails and high-speed desert running. The premium suspension components feature adjustable compression and rebound damping for tuning to specific terrain and rider preference. The rally-inspired bodywork includes a large front fender for sand riding and a streamlined number plate area. The bike comes with a sidestand kill switch for safety and a hour meter to track maintenance intervals. The oversized footpegs provide excellent boot grip, while the handlebar is rubber-mounted to reduce vibration. The quick-release air filter system allows for easy cleaning in dusty conditions, and the toolkit is conveniently stored under the seat. The LED headlight provides excellent visibility for night riding, while the minimalist digital display shows essential information including speed, engine hours, and fuel consumption. With its race-bred components and durable construction, the Desert Raid 700 is built to withstand the toughest off-road challenges while delivering exhilarating performance."
  },
  {
    "id": "9",
    "name": "Cafe Racer 900",
    "images": "https://www.returnofthecaferacers.com/wp-content/uploads/2018/03/titan-thruxton-caferacer-2-e1528079817658.jpg",
    "category": "Standard",
    "topSpeed": "135 mph (217 km/h)",
    "power": "88 hp @ 7,500 rpm",
    "torque": "68 lb-ft @ 5,750 rpm",
    "mileage": "50 mpg (4.7 L/100 km)",
    "brakesType": "Dual 310mm discs with 4-piston calipers (front), Single 255mm disc with 2-piston caliper (rear)",
    "tyreType": "Classic sport, Front: 120/70ZR17, Rear: 160/60ZR17",
    "originalPrice": 11999,
    "bikeWeight": "445 lbs (202 kg)",
    "engineType": "Air-cooled, parallel-twin",
    "companyName": "RetroRide",
    "shortDescription": "The Cafe Racer 900 blends 1960s British cafe racer styling with modern performance and reliability for a uniquely satisfying riding experience.",
    "description": "The Cafe Racer 900 combines retro styling with modern performance to create a motorcycle that captures the spirit of 1960s British cafe racers while delivering contemporary reliability and technology. Built around a torquey 900cc parallel-twin engine, this stylish machine delivers smooth, accessible power perfect for both urban riding and spirited backroad blasts. The minimalist design features a classic teardrop fuel tank, solo seat with rear cowl, and clip-on handlebars that create an aggressive riding position reminiscent of vintage race bikes. Despite its retro appearance, the Cafe Racer 900 boasts modern components including fully adjustable suspension, radial brakes, and LED lighting. The steel trellis frame provides excellent handling characteristics, while the upright but slightly forward-leaning riding position strikes a perfect balance between sporty aggression and all-day comfort. The exhaust system produces a throaty, rhythmic pulse that enhances the vintage riding experience without being overly loud. The Cafe Racer 900 comes equipped with modern safety features including ABS and traction control that can be disabled by purists who prefer a more raw experience. The simple analog-style speedometer with integrated LCD display provides all essential information while maintaining the bike's classic aesthetic. Whether you're commuting through the city, carving canyon roads, or simply enjoying the timeless appeal of a well-executed cafe racer, this motorcycle delivers style and substance in equal measure. The combination of nostalgic design, modern engineering, and accessible performance makes the Cafe Racer 900 appealing to both seasoned riders and those new to the cafe racer scene.",
    "bikeFeature": "The Cafe Racer 900 blends vintage style with modern conveniences. The fuel-injected 900cc parallel-twin engine features a 270-degree crankshaft for authentic character and a satisfying exhaust note. The bike comes with two riding modes (Road and Rain) that adjust throttle response and traction control intervention. The LED lighting includes a circular headlight with daytime running ring that maintains the classic look while improving visibility. The adjustable suspension allows riders to fine-tune the handling to their preference, while the radial-mount brakes provide strong stopping power. Practical features include a USB charging port under the seat and a gear position indicator in the display. The bike comes with a side stand safety switch and steering lock for security. The lightweight 12-spoke alloy wheels combine classic styling with modern performance, shod with contemporary radial tires for excellent grip. The low-maintenance belt drive eliminates chain adjustments and lubrication, while the under-seat storage compartment holds small essentials. The clip-on handlebars are rubber-mounted to reduce vibration, and the footpegs are positioned for an authentic cafe racer riding posture. With its perfect blend of old-school cool and modern functionality, the Cafe Racer 900 offers a uniquely satisfying riding experience that stands out in a crowd."
  },
  {
    "id": "10",
    "name": "Scrambler Urban",
    "images": "https://wallpapercat.com/w/full/c/9/0/5814825.jpg",
    "category": "Dual-Purpose",
    "topSpeed": "100 mph (161 km/h)",
    "power": "65 hp @ 8,000 rpm",
    "torque": "48 lb-ft @ 6,500 rpm",
    "mileage": "55 mpg (4.3 L/100 km)",
    "brakesType": "Single 320mm disc with 4-piston caliper (front), Single 255mm disc with single-piston caliper (rear)",
    "tyreType": "Dual-sport, Front: 110/80R18, Rear: 150/70R17",
    "originalPrice": 9899,
    "bikeWeight": "432 lbs (196 kg)",
    "engineType": "Air-cooled, parallel-twin",
    "companyName": "UrbanScramble",
    "shortDescription": "The Scrambler Urban blends classic 1960s scrambler styling with modern capability, equally at home on city streets or weekend backroad adventures.",
    "description": "The Scrambler Urban is a versatile motorcycle that blends classic styling with modern capability, equally at home on city streets or weekend backroad adventures. Inspired by the scramblers of the 1960s, this bike features an upright riding position, high-mounted exhaust, and aggressive tread tires that hint at its go-anywhere potential. Powered by a lively 800cc parallel-twin engine, the Scrambler Urban delivers smooth, tractable power perfect for both commuting and recreational riding. The steel frame provides a comfortable, stable ride, while the long-travel suspension soaks up urban potholes and light off-road terrain with equal ease. The classic design elements include a round LED headlight, minimal bodywork, and a ribbed seat that pay homage to scrambler heritage while incorporating modern touches. The Scrambler Urban comes equipped with switchable ABS and traction control that can be adjusted based on riding conditions, providing safety on pavement while allowing some rear wheel slip for off-road fun. The comfortable seat height and neutral ergonomics make this bike accessible to a wide range of riders, while the lightweight construction ensures agile handling in all situations. Whether you're navigating city traffic, exploring country lanes, or venturing down unpaved paths, the Scrambler Urban brings a sense of adventure to every ride. The combination of retro styling, modern reliability, and genuine versatility makes this motorcycle a compelling choice for riders who appreciate both form and function.",
    "bikeFeature": "The Scrambler Urban includes features that enhance both style and practicality. The fuel-injected 800cc engine features a 270-degree crankshaft for improved torque and characterful exhaust note. The bike comes with two riding modes (Road and Off-Road) that adjust throttle response and traction control settings. The LED lighting package includes a circular headlight with X-shaped daytime running light signature that nods to classic scramblers. The instrumentation combines an analog-style speedometer with an LCD display showing gear position, fuel level, and trip information. Practical touches include a USB charging port, center stand, and under-seat storage compartment. The high-mounted exhaust allows for better ground clearance when venturing off pavement, while the skid plate protects the engine from debris. The wide handlebars provide excellent control in all conditions, and the upright riding position reduces fatigue on longer rides. The dual-sport tires offer good traction on both pavement and dirt, while the spoked wheels (with tubeless tires) combine classic looks with modern convenience. The bike includes a steering lock and immobilizer for security, along with a toolkit stored under the seat. With its blend of retro charm and contemporary capability, the Scrambler Urban offers a uniquely enjoyable riding experience that encourages exploration both on and off the beaten path."
  },
  {
    "id": "11",
    "name": "Sport Touring 1000",
    "images": "https://cloudfront-us-east-1.images.arcpublishing.com/octane/SANOIAM4FVHSZOIZC6O7BWU36A.jpg",
    "category": "Touring",
    "topSpeed": "155 mph (249 km/h)",
    "power": "148 hp @ 10,000 rpm",
    "torque": "86 lb-ft @ 8,500 rpm",
    "mileage": "44 mpg (5.3 L/100 km)",
    "brakesType": "Dual 320mm discs with radial 4-piston calipers (front), Single 276mm disc with 2-piston caliper (rear)",
    "tyreType": "Sport-touring, Front: 120/70ZR17, Rear: 190/55ZR17",
    "originalPrice": 19499,
    "bikeWeight": "549 lbs (249 kg)",
    "engineType": "Liquid-cooled, inline-four",
    "companyName": "TourMaster",
    "shortDescription": "The Sport Touring 1000 offers the perfect balance of sportbike performance and touring comfort, making it ideal for both long journeys and spirited riding.",
    "description": "The Sport Touring 1000 redefines the sport-touring category with its perfect balance of long-distance comfort and exhilarating performance. Powered by a sophisticated 1,000cc inline-four engine, this motorcycle delivers smooth, effortless power across the entire rev range, making it equally capable of covering continents or attacking twisty mountain passes. The aerodynamic bodywork provides excellent wind protection while maintaining a sporty, aggressive profile, and the adjustable windscreen allows riders to fine-tune airflow to their preference. The comfortable ergonomics feature a slightly forward-leaning riding position that offers a good compromise between sporty handling and touring comfort, with adjustable seat height and handlebar positions available to suit different rider proportions. The Sport Touring 1000 comes equipped with integrated hard luggage that maintains the bike's sleek lines while offering 120 liters of weatherproof storage capacity. The advanced electronics package includes multiple riding modes, cruise control, heated grips, and a full-color TFT display with smartphone connectivity. The suspension features electronic adjustment that automatically adapts to riding conditions and load, or can be manually configured via the onboard computer. Whether you're embarking on a cross-country tour, commuting through city traffic, or enjoying a spirited weekend ride, the Sport Touring 1000 delivers exceptional versatility without compromising performance. The combination of sportbike-like handling, touring comfort, and advanced technology makes this motorcycle the ideal choice for riders who refuse to choose between excitement and practicality.",
    "bikeFeature": "The Sport Touring 1000 is packed with features designed for both performance and comfort. The 1,000cc engine features ride-by-wire throttle control with four riding modes (Rain, Road, Dynamic, and Rider). The quick-shifter allows for clutchless upshifts and downshifts, while the electronic suspension adjustment automatically adapts to load and riding conditions. The full-color 6.5-inch TFT display supports smartphone connectivity for navigation, music, and calls, with intuitive control via a multi-function wheel. Comfort features include heated seats for rider and passenger, heated grips, and adjustable windscreen. The integrated luggage system includes 37-liter side cases that are matched to the bike's color scheme and can be easily removed when not needed. Safety features include cornering ABS, lean-angle sensitive traction control, and tire pressure monitoring. The LED lighting system includes adaptive cornering lights and self-canceling turn signals. Practical touches include a 12V power outlet, USB charging port, and center stand. The large 6-gallon fuel tank provides excellent range between fill-ups, while the comprehensive instrumentation includes fuel consumption data and range estimation. With its blend of sportbike performance and touring comfort, the Sport Touring 1000 sets new standards for what a do-it-all motorcycle can achieve."
  },
  {
    "id": "12",
    "name": "Classic Cruiser 500",
    "images": "https://imgcdn.zigwheels.my/large/gallery/exterior/89/1415/royal-enfield-classic-500-marketing-image-765056.jpg",
    "category": "Cruiser",
    "topSpeed": "95 mph (153 km/h)",
    "power": "45 hp @ 7,500 rpm",
    "torque": "42 lb-ft @ 5,500 rpm",
    "mileage": "60 mpg (3.9 L/100 km)",
    "brakesType": "Single 320mm disc with 2-piston caliper (front), Single 240mm disc with single-piston caliper (rear)",
    "tyreType": "Cruiser, Front: 130/90B16, Rear: 150/80B16",
    "originalPrice": 6999,
    "bikeWeight": "498 lbs (226 kg)",
    "engineType": "Air-cooled, parallel-twin",
    "companyName": "Classic Ride",
    "shortDescription": "The Classic Cruiser 500 captures the essence of 1950s American motorcycling in an accessible, modern package perfect for new and experienced riders alike.",
    "description": "The Classic Cruiser 500 captures the essence of traditional American motorcycling in an accessible, modern package perfect for new riders and experienced enthusiasts alike. Powered by a smooth 500cc parallel-twin engine, this motorcycle delivers relaxed, torquey performance with excellent fuel efficiency and low maintenance requirements. The low seat height and forward-mounted foot controls create the quintessential cruiser riding position, while the wide handlebars provide light, easy steering at all speeds. The Classic Cruiser 500 features timeless styling elements including teardrop fuel tank, round headlight, and abundant chrome accents that pay homage to motorcycles of the 1950s and 60s. The suspension is tuned for a plush, comfortable ride that soaks up road imperfections, while the wide, supportive seat ensures all-day comfort for rider and passenger. Despite its retro appearance, the Classic Cruiser 500 includes modern conveniences like fuel injection, electric start, and disc brakes at both ends. The exhaust system produces a mellow, throaty rumble that enhances the riding experience without being overly loud. Whether you're cruising through town, taking scenic backroad rides, or simply enjoying the wind in your face, the Classic Cruiser 500 delivers pure, simple motorcycling pleasure. The combination of approachable performance, classic styling, and modern reliability makes this bike an excellent choice for riders who appreciate traditional cruiser values without compromising on contemporary engineering and quality.",
    "bikeFeature": "The Classic Cruiser 500 includes features that enhance both style and rideability. The fuel-injected 500cc parallel-twin engine features a 180-degree crankshaft for smooth power delivery and classic character. The instrumentation combines an analog speedometer with LCD display showing odometer, trip meters, and fuel level. The LED lighting includes a circular headlight with classic styling and bright taillight for visibility. Comfort features include a thickly padded seat and rubber-mounted footpegs to reduce vibration. Practical touches include a steering lock, helmet lock, and under-seat storage compartment. The bike comes with a security system that includes an immobilizer, while the maintenance-free battery and sealed chain reduce upkeep requirements. The wide handlebars provide excellent leverage for low-speed maneuvering, while the forward foot controls create an authentic cruiser riding position. The single-pin stripe paint scheme and chrome accents give the bike timeless appeal, while the spoked wheels (with tubeless tires) combine classic looks with modern convenience. With its combination of traditional styling and contemporary engineering, the Classic Cruiser 500 offers an authentic motorcycling experience that's both accessible and rewarding."
  },
  {
    "id": "13",
    "name": "Adventure Tour 1200",
    "images": "https://imgcdnblog.carbay.com/bikeBlog/wp-content/uploads/2015/11/24083102/bmw-r1200gs-8.jpg",
    "category": "Dual-Purpose",
    "topSpeed": "130 mph (209 km/h)",
    "power": "125 hp @ 8,500 rpm",
    "torque": "92 lb-ft @ 6,500 rpm",
    "mileage": "48 mpg (4.9 L/100 km)",
    "brakesType": "Dual 305mm discs with 4-piston calipers (front), Single 276mm disc with 2-piston caliper (rear)",
    "tyreType": "Adventure, Front: 110/80R19, Rear: 150/70R17",
    "originalPrice": 17899,
    "bikeWeight": "573 lbs (260 kg)",
    "engineType": "Liquid-cooled, boxer-twin",
    "companyName": "Adventure Touring",
    "shortDescription": "The Adventure Tour 1200 is the ultimate exploration machine, equally capable of crossing continents on pavement or venturing far off the beaten path.",
    "description": "The Adventure Tour 1200 is the ultimate long-distance exploration machine, equally capable of crossing continents on pavement or venturing far off the beaten path. Powered by a torquey 1,200cc boxer-twin engine, this adventure bike delivers smooth, accessible power in all conditions while providing excellent durability and reliability. The tall suspension provides 8.7 inches of ground clearance for off-road capability, while the electronic suspension adjustment automatically adapts to load and riding conditions for optimal comfort and handling. The upright riding position offers excellent visibility and control, with adjustable seat height and handlebar positions to suit different rider proportions. The Adventure Tour 1200 comes equipped with integrated luggage mounts and a large 7.9-gallon fuel tank for extended range in remote areas. The advanced electronics package includes multiple riding modes, hill start control, dynamic traction control, and cornering ABS that can be adjusted for off-road use. The comprehensive protection package includes engine guards, handguards, and a sturdy skid plate for serious adventure riding. Whether you're commuting through city traffic, touring across countries, or exploring remote wilderness trails, the Adventure Tour 1200 handles every challenge with confidence and capability. The combination of long-distance comfort, genuine off-road performance, and advanced technology makes this motorcycle the perfect companion for riders who dream of endless horizons and uncharted routes.",
    "bikeFeature": "The Adventure Tour 1200 is packed with features designed for serious exploration. The 1,200cc boxer engine features ride-by-wire throttle control with four riding modes (Rain, Road, Dynamic, and Enduro). The semi-active suspension automatically adjusts damping based on riding conditions and load, with multiple manual settings available. The full-color 6.5-inch TFT display supports smartphone connectivity for navigation, music, and calls, with intuitive control via a multi-function wheel. The integrated crash bars and engine protection plate safeguard vital components during off-road adventures. Comfort features include heated grips, adjustable windscreen, and optional heated seats. The LED lighting system includes adaptive cornering lights and emergency brake light flashing. Practical touches include multiple 12V power outlets, USB charging port, and center stand. The tubeless spoke wheels combine off-road durability with on-road convenience, while the comprehensive instrumentation includes fuel consumption data, range estimation, and altitude display. With its combination of touring comfort, off-road capability, and advanced technology, the Adventure Tour 1200 is ready to take you anywhere your wanderlust leads."
  },
  {
    "id": "14",
    "name": "Super Sport 1000RR",
    "images": "https://global-fs.webike-cdn.net/@japan/moto_news/wp-content/uploads/2020/03/1eabdadf93dbd0ab97f8db6b614c006c.jpg",
    "category": "Sports",
    "topSpeed": "186 mph (299 km/h)",
    "power": "205 hp @ 13,500 rpm",
    "torque": "85 lb-ft @ 11,000 rpm",
    "mileage": "35 mpg (6.7 L/100 km)",
    "brakesType": "Dual 330mm discs with radial-mount Brembo Stylema 4-piston calipers (front), Single 220mm disc with 2-piston caliper (rear)",
    "tyreType": "Sport, Front: 120/70ZR17, Rear: 200/55ZR17",
    "originalPrice": 24999,
    "bikeWeight": "432 lbs (196 kg)",
    "engineType": "Liquid-cooled, inline-four",
    "companyName": "RaceTech",
    "shortDescription": "The Super Sport 1000RR represents the pinnacle of production sportbike performance, incorporating cutting-edge technology and race-proven engineering.",
    "description": "The Super Sport 1000RR represents the pinnacle of production sportbike performance, incorporating cutting-edge technology and race-proven engineering to deliver breathtaking speed and handling. This track-focused machine is powered by a screaming 1,000cc inline-four engine that produces over 200 horsepower, with power delivery optimized by advanced electronics including traction control, wheelie control, and launch control. The ultra-lightweight chassis features a magnesium subframe and swingarm to minimize weight while maximizing rigidity, resulting in razor-sharp handling that inspires confidence at extreme lean angles. The aerodynamic bodywork has been honed in wind tunnels to reduce drag and increase high-speed stability, while providing excellent wind protection for the rider. The Super Sport 1000RR comes equipped with premium hlins electronic suspension that automatically adjusts to riding conditions and can be manually configured via the onboard computer. The aggressive riding position places the rider in perfect harmony with the machine, allowing for precise control during high-performance riding. Despite its race-bred nature, this superbike includes street-legal lighting and mirrors, making it (barely) suitable for road use. Whether you're chasing lap times on the track or experiencing the thrill of maximum acceleration on closed courses, the Super Sport 1000RR delivers an adrenaline-fueled riding experience that few production motorcycles can match. The combination of exotic materials, advanced electronics, and race-derived engineering makes this machine the closest thing to a MotoGP bike available to the public.",
    "bikeFeature": "The Super Sport 1000RR is packed with race-inspired features that maximize performance. The 1,000cc engine features titanium valves, forged pistons, and a counter-rotating crankshaft to reduce gyroscopic effects. The electronics package includes six riding modes (Rain, Road, Dynamic, Race, and two User-defined), each adjusting power delivery, traction control, wheelie control, and engine braking. The quick-shifter allows for clutchless upshifts and downshifts at full throttle, while the slipper clutch prevents rear-wheel hop during aggressive downshifts. The full-color TFT display shows lap times, gear position indicator, and shift lights with programmable rpm points. The LED lighting includes a distinctive daytime running light signature, while the aerodynamic winglets provide downforce at high speeds. The lightweight aluminum wheels reduce unsprung weight for better handling, while the radial-mount Brembo brakes offer exceptional stopping power. The bike comes with a steering damper to enhance stability, and the adjustable footpegs and handlebars allow for personalized ergonomics. With its no-compromise approach to performance, the Super Sport 1000RR is engineered for riders who demand the ultimate in speed and precision."
  },
  {
    "id": "15",
    "name": "Retro Classic 350",
    "images": "https://bikesguide.bikroy.com/wp-content/uploads/2024/01/Royal-Enfield-Classic-350.jpg",
    "category": "Standard",
    "topSpeed": "75 mph (121 km/h)",
    "power": "25 hp @ 6,500 rpm",
    "torque": "22 lb-ft @ 4,000 rpm",
    "mileage": "85 mpg (2.8 L/100 km)",
    "brakesType": "Single 300mm disc with 2-piston caliper (front), Drum brake (rear)",
    "tyreType": "Classic, Front: 100/90-18, Rear: 120/80-18",
    "originalPrice": 5499,
    "bikeWeight": "401 lbs (182 kg)",
    "engineType": "Air-cooled, single-cylinder",
    "companyName": "Vintage Motors",
    "shortDescription": "The Retro Classic 350 celebrates the golden era of motorcycling with authentic 1950s styling and simple, honest character for pure riding pleasure.",
    "description": "The Retro Classic 350 celebrates the golden era of motorcycling with its authentic 1950s styling and simple, honest character. This charming motorcycle is powered by a air-cooled 350cc single-cylinder engine that delivers modest but satisfying performance perfect for relaxed cruising and city commuting. The Retro Classic 350 features all the design elements that made vintage motorcycles so appealing: teardrop fuel tank, sprung solo seat, chrome fenders, and a distinctive exhaust note that harks back to simpler times. The upright riding position and low seat height make this bike accessible to riders of all sizes and experience levels, while the lightweight chassis ensures easy handling at all speeds. Despite its vintage appearance, the Retro Classic 350 includes modern upgrades like electric start, disc front brake, and fuel injection for reliable operation in all conditions. The suspension is tuned for comfort rather than sporty handling, soaking up bumps with a plush ride that encourages leisurely exploration of backroads and city streets. The simple analog instrumentation includes only the essentials - speedometer, odometer, and warning lights - maintaining the bike's old-school aesthetic. Whether you're a seasoned rider looking for a nostalgic second bike or a newcomer attracted to classic styling, the Retro Classic 350 delivers pure, simple motorcycling pleasure without pretense or complexity. The combination of timeless design, approachable performance, and excellent fuel efficiency makes this motorcycle a charming alternative to modern, high-tech machines.",
    "bikeFeature": "The Retro Classic 350 includes features that enhance its vintage appeal while providing modern convenience. The fuel-injected 350cc single-cylinder engine features a counterbalancer to reduce vibration while maintaining classic character. The bike comes with a center stand for easy parking and maintenance, along with a side stand safety switch. The LED lighting includes a classic-style circular headlight with modern brightness, while the turn signals feature vintage-style lenses. Practical touches include a helmet lock, luggage rack, and under-seat storage compartment. The suspension features vintage-style twin shock absorbers at the rear and telescopic forks at the front, tuned for comfort rather than sporty handling. The spoked wheels with tube-type tires complete the classic look, while the drum rear brake maintains the vintage aesthetic. The bike includes a security system with steering lock and immobilizer, while the maintenance-free battery reduces upkeep requirements. With its combination of old-world charm and modern reliability, the Retro Classic 350 offers a uniquely satisfying riding experience that transports you back to motorcycling's golden age."
  },
  {
    "id": "16",
    "name": "Touring Elite 1800",
    "images": "https://cdn.shopify.com/s/files/1/0762/7194/3984/files/pearl-white-2.jpg?v=1700766654",
    "category": "Touring",
    "topSpeed": "120 mph (193 km/h)",
    "power": "125 hp @ 5,500 rpm",
    "torque": "125 lb-ft @ 4,000 rpm",
    "mileage": "40 mpg (5.9 L/100 km)",
    "brakesType": "Dual 320mm discs with 4-piston calipers (front), Single 316mm disc with 3-piston caliper (rear)",
    "tyreType": "Touring, Front: 130/70B18, Rear: 180/60B16",
    "originalPrice": 32999,
    "bikeWeight": "928 lbs (421 kg)",
    "engineType": "Liquid-cooled, horizontally-opposed six-cylinder",
    "companyName": "Luxury Touring",
    "shortDescription": "The Touring Elite 1800 is the ultimate luxury touring motorcycle, designed to devour continents with unparalleled comfort and sophistication.",
    "description": "The Touring Elite 1800 is the ultimate luxury touring motorcycle, designed to devour continents with unparalleled comfort and sophistication. Powered by a massive 1,800cc horizontally-opposed six-cylinder engine, this two-wheeled limousine delivers smooth, effortless power perfect for long-distance travel. The spacious touring platform features a full fairing with adjustable wind deflectors, electrically adjustable windscreen, and generous seating for rider and passenger that rivals luxury automobiles in comfort. The Touring Elite 1800 comes equipped with every conceivable amenity including an advanced audio system with Bluetooth connectivity, GPS navigation, heated seats and grips, and even a reverse gear for easy maneuvering. The innovative suspension system automatically adjusts to road conditions and load, providing a magic carpet ride that soaks up bumps while maintaining precise handling. With over 150 liters of integrated, weatherproof storage capacity, this touring machine can carry enough luggage for extended journeys without the need for additional bags. The comprehensive safety systems include adaptive cruise control, collision warning, blind spot monitoring, and tire pressure monitoring - all designed to reduce rider fatigue and enhance safety during long days in the saddle. Whether you're embarking on a cross-country adventure or simply enjoying a weekend getaway, the Touring Elite 1800 transforms every journey into a first-class experience. The combination of luxurious comfort, advanced technology, and impressive performance makes this motorcycle the undisputed king of the touring category.",
    "bikeFeature": "The Touring Elite 1800 is packed with luxury features that redefine touring comfort. The 1,800cc six-cylinder engine features a dual-overhead cam design with four valves per cylinder for smooth, powerful performance. The bike comes with multiple riding modes (Tour, Sport, Rain, and Economy) that adjust throttle response, suspension settings, and traction control. The full-color 10-inch TFT display supports smartphone connectivity for navigation, music, and calls, with intuitive control via a multi-function wheel and voice commands. Comfort features include heated and ventilated seats for rider and passenger, heated grips and backrest, and adjustable floorboards. The advanced audio system includes fairing-mounted speakers, helmet headset integration, and Apple CarPlay/Android Auto compatibility. Safety features include adaptive cruise control, blind spot monitoring, and emergency brake assist. The LED lighting system includes adaptive cornering lights and self-canceling turn signals. Practical touches include multiple power outlets, USB charging ports, and a central locking system for all storage compartments. The large 7.5-gallon fuel tank provides excellent range between fill-ups, while the comprehensive instrumentation includes fuel consumption data, range estimation, and maintenance reminders. With its unparalleled combination of luxury and capability, the Touring Elite 1800 sets the standard for premium touring motorcycles."
  },
  {
    "id": "17",
    "name": "Dual Sport 650",
    "images": "https://content2.kawasaki.com/ContentStorage/KMC/Products/9514/b581c6c0-1ad7-44e7-9e2d-c63a2e61e353.png?w=767",
    "category": "Dual-Purpose",
    "topSpeed": "110 mph (177 km/h)",
    "power": "58 hp @ 7,500 rpm",
    "torque": "46 lb-ft @ 6,500 rpm",
    "mileage": "55 mpg (4.3 L/100 km)",
    "brakesType": "Single 310mm disc with 2-piston caliper (front), Single 240mm disc with single-piston caliper (rear)",
    "tyreType": "Dual-sport, Front: 90/90-21, Rear: 130/80-18",
    "originalPrice": 8799,
    "bikeWeight": "386 lbs (175 kg)",
    "engineType": "Liquid-cooled, single-cylinder",
    "companyName": "TrailBlazer",
    "shortDescription": "The Dual Sport 650 offers genuine off-road capability with street-legal practicality, making it perfect for both trail riding and highway commuting.",
    "description": "The Dual Sport 650 is the perfect compromise between off-road capability and on-road practicality, offering genuine dirt-worthy performance in a street-legal package. Powered by a torquey 650cc single-cylinder engine, this versatile motorcycle delivers strong low-end and mid-range power perfect for both trail riding and highway commuting. The high-strength steel frame provides excellent durability while keeping weight manageable, and the long-travel suspension (10 inches front and rear) soaks up rough terrain with ease. The upright riding position offers excellent visibility and control in all conditions, while the narrow seat and bodywork allow for easy rider movement when standing on the pegs. The Dual Sport 650 features switchable ABS that can be disabled for off-road riding, along with basic traction control to help manage the bike's torquey power delivery in slippery conditions. The 21-inch front wheel and 18-inch rear wheel combination provides excellent off-road capability while maintaining reasonable on-road manners. With its comfortable seat, reasonable wind protection, and 5-gallon fuel tank, the Dual Sport 650 is capable of handling longer road trips between off-road adventures. Whether you're commuting through city traffic, exploring forest service roads, or simply enjoying the versatility of a true do-anything motorcycle, the Dual Sport 650 delivers fun and practicality in equal measure. The combination of lightweight agility, torquey power, and genuine off-road capability makes this bike a favorite among riders who refuse to be limited by pavement.",
    "bikeFeature": "The Dual Sport 650 includes features that enhance both on-road and off-road performance. The fuel-injected 650cc single-cylinder engine features a counterbalancer to reduce vibration and a heavy-duty cooling system for reliability. The bike comes with two riding modes (Road and Off-Road) that adjust throttle response and traction control settings. The LCD instrument panel includes a gear position indicator, fuel gauge, and clock, while the LED lighting ensures good visibility in all conditions. Practical touches include a 12V power outlet, center stand, and under-seat storage compartment. The high-mounted front fender and exhaust provide excellent ground clearance, while the skid plate protects the engine from rocks and debris. The handlebar is rubber-mounted to reduce vibration, and the wide footpegs provide excellent boot grip in all conditions. The spoked wheels (with tubeless tires) combine off-road durability with on-road convenience, while the chain features an O-ring design for reduced maintenance. With its combination of dirt-worthy capability and street-legal practicality, the Dual Sport 650 is ready for adventure wherever your travels take you."
  },
  {
    "id": "18",
    "name": "Hyper Naked 1000",
    "images": "https://www.webbikeworld.com/wp-content/uploads/2023/08/web_bike_world_BMW_M_1000_R_motorcycle_ride_review_08.jpg",
    "category": "Standard",
    "topSpeed": "165 mph (266 km/h)",
    "power": "160 hp @ 11,000 rpm",
    "torque": "85 lb-ft @ 9,000 rpm",
    "mileage": "42 mpg (5.6 L/100 km)",
    "brakesType": "Dual 330mm discs with radial-mount Brembo M50 4-piston calipers (front), Single 245mm disc with 2-piston caliper (rear)",
    "tyreType": "Sport, Front: 120/70ZR17, Rear: 190/55ZR17",
    "originalPrice": 16299,
    "bikeWeight": "452 lbs (205 kg)",
    "engineType": "Liquid-cooled, inline-four",
    "companyName": "Street Demon",
    "shortDescription": "The Hyper Naked 1000 is a no-holds-barred streetfighter that combines brutal acceleration with razor-sharp handling and aggressive styling.",
    "description": "The Hyper Naked 1000 is a no-holds-barred streetfighter that combines brutal acceleration with razor-sharp handling and aggressive styling. Powered by a detuned superbike engine, this naked bike delivers explosive performance with a more accessible power band perfect for real-world riding. The minimalist design showcases the mechanical components, with the trellis frame, high-mounted exhaust, and muscular fuel tank creating an intimidating presence. The upright but slightly forward-leaning riding position offers excellent control and visibility, while the wide handlebars provide leverage for aggressive cornering. Despite its stripped-down appearance, the Hyper Naked 1000 features sophisticated electronics including multiple riding modes, traction control, wheelie control, and cornering ABS that can be adjusted to suit rider preference. The high-quality suspension components provide responsive handling without sacrificing too much comfort, making this bike surprisingly capable on longer rides. The LED lighting gives the Hyper Naked a modern, high-tech appearance while improving visibility, and the full-color TFT display provides all essential information in a clean, customizable format. Whether you're blasting through city streets, attacking mountain passes, or simply enjoying the visceral thrill of unfiltered acceleration, the Hyper Naked 1000 delivers adrenaline-pumping performance with street-smart practicality. The combination of brutal power, lightweight agility, and head-turning style makes this motorcycle impossible to ignore wherever it goes.",
    "bikeFeature": "The Hyper Naked 1000 comes loaded with performance-focused features that enhance both fun and safety. The 1,000cc engine features ride-by-wire throttle control with four riding modes (Rain, Road, Sport, and Track). The quick-shifter allows for clutchless upshifts at full throttle, while the slipper clutch prevents rear-wheel hop during aggressive downshifts. The full-color TFT display changes appearance based on selected riding mode and includes a gear position indicator and shift lights. The LED lighting package includes a distinctive daytime running light signature and ultra-bright tail light. Practical touches include a USB charging port under the seat and adjustable brake and clutch levers. The lightweight aluminum wheels reduce unsprung weight for better handling, while the radial-mount Brembo brakes provide exceptional stopping power. The bike comes with a steering damper to enhance stability at high speeds, and the adjustable suspension can be tuned for rider weight and preference. The compact design includes clever details like an under-engine exhaust that keeps the center of gravity low and the tail section clean. With its combination of cutting-edge technology and raw, unfiltered performance, the Hyper Naked 1000 delivers an exhilarating riding experience that appeals to experienced motorcyclists who appreciate both power and precision."
  },
  {
    "id": "19",
    "name": "Electric Urbanite",
    "images": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ5W3ocibDNBmiPnqqFsXFbmRgUf2DTEQwUzQ&s",
    "category": "Standard",
    "topSpeed": "85 mph (137 km/h)",
    "power": "72 hp (equivalent)",
    "torque": "120 lb-ft (instant)",
    "mileage": "130 MPGe (equivalent)",
    "brakesType": "Single 320mm disc with 4-piston caliper (front), Single 260mm disc with 2-piston caliper (rear)",
    "tyreType": "Street, Front: 110/70R17, Rear: 140/70R17",
    "originalPrice": 12999,
    "bikeWeight": "396 lbs (180 kg)",
    "engineType": "Electric motor with lithium-ion battery",
    "companyName": "EcoRide",
    "shortDescription": "The Electric Urbanite represents the future of urban motorcycling with zero-emission electric power, instant torque, and sleek modern design.",
    "description": "The Electric Urbanite represents the future of urban motorcycling, combining zero-emission electric power with sleek, modern design and instant torque delivery. Powered by a high-capacity lithium-ion battery and advanced electric motor, this innovative motorcycle delivers silent, vibration-free acceleration that outpaces many conventional bikes in city riding conditions. The Electric Urbanite features a minimalist design with clean lines and integrated components that highlight its futuristic technology. The low center of gravity created by the floor-mounted battery pack contributes to excellent handling and stability at all speeds. With a range of up to 120 miles in city riding (or 70 miles at highway speeds), this electric motorcycle is perfect for daily commuting and urban exploration. The Electric Urbanite comes equipped with multiple riding modes (Eco, City, Sport, and Custom) that adjust power delivery and regenerative braking strength to maximize range or performance based on rider preference. The lightweight aluminum frame and quality suspension components provide responsive handling that makes navigating city traffic effortless. The full-color TFT display shows battery status, range estimation, riding mode, and other essential information in a clean, easy-to-read format. Whether you're looking to reduce your carbon footprint, save on fuel costs, or simply experience the unique thrill of electric motorcycling, the Electric Urbanite offers a compelling alternative to traditional gasoline-powered bikes. The combination of instant torque, silent operation, and low maintenance requirements makes this motorcycle an exciting glimpse into the future of urban transportation.",
    "bikeFeature": "The Electric Urbanite is packed with innovative features that enhance the electric riding experience. The liquid-cooled electric motor delivers instant maximum torque from zero rpm, with no gears to shift. The 15 kWh lithium-ion battery can be charged to 80% in just 45 minutes using a DC fast charger, or fully charged in 4 hours with a Level 2 charger. The bike comes with smartphone connectivity that allows for battery status monitoring, charging scheduling, and ride data analysis. Regenerative braking helps extend range by recovering energy during deceleration, with adjustable strength based on riding mode. The full LED lighting includes a distinctive daytime running light signature and automatic high beam control. Practical touches include a USB charging port, under-seat storage compartment, and center stand. The lightweight cast aluminum wheels contribute to the bike's agile handling, while the combined braking system provides strong, predictable stopping power. The bike includes multiple security features including GPS tracking, geofencing, and an alarm system. With its combination of cutting-edge electric technology and urban practicality, the Electric Urbanite offers a uniquely modern riding experience that's both environmentally friendly and incredibly fun."
  },
  {
    "id": "20",
    "name": "Bagger Limited",
    "images": "https://www.indianmotorcycle.fi/fileadmin/templates/model_23/swap/intl/challenger-limited/challenger-limited-maroon-metallic.jpg",
    "category": "Cruiser",
    "topSpeed": "115 mph (185 km/h)",
    "power": "105 hp @ 5,500 rpm",
    "torque": "122 lb-ft @ 3,500 rpm",
    "mileage": "42 mpg (5.6 L/100 km)",
    "brakesType": "Dual 320mm discs with 4-piston calipers (front), Single 298mm disc with 2-piston caliper (rear)",
    "tyreType": "Cruiser, Front: 130/60B19, Rear: 180/55B18",
    "originalPrice": 24899,
    "bikeWeight": "815 lbs (370 kg)",
    "engineType": "Air/oil-cooled, V-twin",
    "companyName": "American Classic",
    "shortDescription": "The Bagger Limited combines classic bagger styling with modern touring luxury, offering premium amenities and effortless highway cruising.",
    "description": "The Bagger Limited is the ultimate expression of American touring luxury, combining classic bagger styling with modern performance and premium amenities. Powered by a massive 1,800cc V-twin engine, this full-dress touring cruiser delivers ample torque for effortless highway cruising while maintaining the iconic look that defines the bagger segment. The Bagger Limited features a sleek, low-profile design with integrated hard saddlebags and a distinctive batwing fairing that provides excellent wind protection without excessive bulk. The comfortable riding position features floorboards for the rider, a plush two-up seat, and ergonomically designed handlebars that reduce fatigue on long journeys. Despite its classic appearance, the Bagger Limited is packed with modern technology including a powerful infotainment system with touchscreen display, Bluetooth connectivity, and premium audio. The advanced suspension system provides a plush ride that soaks up highway imperfections while maintaining precise handling in corners. The comprehensive lighting package includes bright LED headlights, running lights, and turn signals that enhance both style and visibility. Whether you're embarking on a cross-country tour or simply enjoying weekend rides with your favorite passenger, the Bagger Limited delivers an unmatched combination of style, comfort, and performance. The attention to detail in the paint, chrome, and accessories makes this motorcycle a rolling work of art that turns heads wherever it goes, while the comfortable ergonomics and ample storage make it perfectly suited for serious touring.",
    "bikeFeature": "The Bagger Limited boasts an impressive array of features designed for touring comfort and style. The air/oil-cooled 1,800cc V-twin engine features a counterbalanced design for smooth operation and electronic throttle control. The bike comes with multiple riding modes (Tour, Sport, and Rain) that adjust throttle response and traction control settings. The 6.5-inch touchscreen infotainment system includes GPS navigation, Apple CarPlay/Android Auto compatibility, and premium audio with fairing-mounted speakers. Comfort features include heated grips, adjustable windscreen, and optional heated seats. The integrated hard saddlebags provide 50 liters of weatherproof storage, with one-touch opening mechanisms for convenience. Safety features include cornering ABS, tire pressure monitoring, and cruise control. The LED lighting system includes adaptive cornering lights and self-canceling turn signals. Practical touches include multiple power outlets, USB charging ports, and a security system with keyless ignition. The large 6-gallon fuel tank provides excellent range between fill-ups, while the comprehensive instrumentation includes fuel consumption data and range estimation. With its perfect blend of classic bagger styling and modern touring capability, the Bagger Limited offers an unforgettable riding experience that celebrates American motorcycle heritage."
  }
]